iworx-systems/Zephyr-Dev-Container-Template/.devcontainer/M481_v1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DSCT_NEXT</name>
      <description>PDMA Register Map</description>
      <groupName>PDMA</groupName>
      <baseAddress>0x4000800C</baseAddress>
      <!-- d -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x40</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x50</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x60</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x70</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x80</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x90</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xA0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xB0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xD0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xE0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xF0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>PDMA_DSCT0_NEXT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PDMA_DSCT0_NEXT</displayName>
          <description>Next Scatter-gather Descriptor Table Offset Address of PDMA Channel n</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>NEXT</name>
              <description>PDMA Next Descriptor Table Offset\nThis field indicates the offset of the next descriptor table address in system memory. \nWrite Operation:\nIf the system memory based address is 0x2000_0000 (PDMA_SCATBA), and the next descriptor table is start from 0x2000_0100, then this field must fill in 0x0100.\nRead Operation:\nWhen operating in scatter-gather mode, the last two bits NEXT[1:0] will become reserved, and indicate the first next address of system memory.\nNote 1: The descriptor table address must be word boundary.\nNote 2: Before filled transfer task in the descriptor table, user must check if the descriptor table is complete.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXENEXT</name>
              <description>PDMA Execution Next Descriptor Table Offset\nThis field indicates the offset of next descriptor table address of current execution descriptor table in system memory. \nNote: write operation is useless in this field.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="PDMA_DSCT0_NEXT">
          <name>PDMA_DSCT1_NEXT</name>
          <displayName>PDMA_DSCT1_NEXT</displayName>
          <description>Next Scatter-gather Descriptor Table Offset Address of PDMA Channel n</description>
          <addressOffset>0x10</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_NEXT">
          <name>PDMA_DSCT2_NEXT</name>
          <displayName>PDMA_DSCT2_NEXT</displayName>
          <description>Next Scatter-gather Descriptor Table Offset Address of PDMA Channel n</description>
          <addressOffset>0x20</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_NEXT">
          <name>PDMA_DSCT3_NEXT</name>
          <displayName>PDMA_DSCT3_NEXT</displayName>
          <description>Next Scatter-gather Descriptor Table Offset Address of PDMA Channel n</description>
          <addressOffset>0x30</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_NEXT">
          <name>PDMA_DSCT4_NEXT</name>
          <displayName>PDMA_DSCT4_NEXT</displayName>
          <description>Next Scatter-gather Descriptor Table Offset Address of PDMA Channel n</description>
          <addressOffset>0x40</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_NEXT">
          <name>PDMA_DSCT5_NEXT</name>
          <displayName>PDMA_DSCT5_NEXT</displayName>
          <description>Next Scatter-gather Descriptor Table Offset Address of PDMA Channel n</description>
          <addressOffset>0x50</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_NEXT">
          <name>PDMA_DSCT6_NEXT</name>
          <displayName>PDMA_DSCT6_NEXT</displayName>
          <description>Next Scatter-gather Descriptor Table Offset Address of PDMA Channel n</description>
          <addressOffset>0x60</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_NEXT">
          <name>PDMA_DSCT7_NEXT</name>
          <displayName>PDMA_DSCT7_NEXT</displayName>
          <description>Next Scatter-gather Descriptor Table Offset Address of PDMA Channel n</description>
          <addressOffset>0x70</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_NEXT">
          <name>PDMA_DSCT8_NEXT</name>
          <displayName>PDMA_DSCT8_NEXT</displayName>
          <description>Next Scatter-gather Descriptor Table Offset Address of PDMA Channel n</description>
          <addressOffset>0x80</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_NEXT">
          <name>PDMA_DSCT9_NEXT</name>
          <displayName>PDMA_DSCT9_NEXT</displayName>
          <description>Next Scatter-gather Descriptor Table Offset Address of PDMA Channel n</description>
          <addressOffset>0x90</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_NEXT">
          <name>PDMA_DSCT10_NEXT</name>
          <displayName>PDMA_DSCT10_NEXT</displayName>
          <description>Next Scatter-gather Descriptor Table Offset Address of PDMA Channel n</description>
          <addressOffset>0xA0</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_NEXT">
          <name>PDMA_DSCT11_NEXT</name>
          <displayName>PDMA_DSCT11_NEXT</displayName>
          <description>Next Scatter-gather Descriptor Table Offset Address of PDMA Channel n</description>
          <addressOffset>0xB0</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_NEXT">
          <name>PDMA_DSCT12_NEXT</name>
          <displayName>PDMA_DSCT12_NEXT</displayName>
          <description>Next Scatter-gather Descriptor Table Offset Address of PDMA Channel n</description>
          <addressOffset>0xC0</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_NEXT">
          <name>PDMA_DSCT13_NEXT</name>
          <displayName>PDMA_DSCT13_NEXT</displayName>
          <description>Next Scatter-gather Descriptor Table Offset Address of PDMA Channel n</description>
          <addressOffset>0xD0</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_NEXT">
          <name>PDMA_DSCT14_NEXT</name>
          <displayName>PDMA_DSCT14_NEXT</displayName>
          <description>Next Scatter-gather Descriptor Table Offset Address of PDMA Channel n</description>
          <addressOffset>0xE0</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_NEXT">
          <name>PDMA_DSCT15_NEXT</name>
          <displayName>PDMA_DSCT15_NEXT</displayName>
          <description>Next Scatter-gather Descriptor Table Offset Address of PDMA Channel n</description>
          <addressOffset>0xF0</addressOffset>
       </register>
