iworx-systems/Zephyr-Dev-Container-Template/.devcontainer/M481_v1.svd
       <register>
          <name>EPWM_DTCTL0_1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EPWM_DTCTL0_1</displayName>
          <description>EPWM Dead-time Control Register 0/1</description>
          <addressOffset>0x70</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DTCNT</name>
              <description>Dead-time Counter (Write Protect)\nThe dead-time can be calculated from the following formula: \nNote: This bit is write protected. Refer to SYS_REGLCTL register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTEN</name>
              <description>Enable Dead-time Insertion for EPWM Pair (EPWM_CH0, EPWM_CH1) (EPWM_CH2, EPWM_CH3) (EPWM_CH4, EPWM_CH5) (Write Protect)\nDead-time insertion is only active when this pair of complementary EPWM is enabled. If dead- time insertion is inactive, the outputs of pin pair are complementary without any delay.\nNote: This bit is write protected. Refer to SYS_REGLCTL register.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Dead-time insertion Disabled on the pin pair</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Dead-time insertion Enabled on the pin pair</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DTCKSEL</name>
              <description>Dead-time Clock Select (Write Protect)\nNote: This bit is write protected. Refer to REGWRPROT register.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Dead-time clock source from EPWM_CLK</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Dead-time clock source from prescaler output</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EPWM_DTCTL0_1">
          <name>EPWM_DTCTL2_3</name>
          <displayName>EPWM_DTCTL2_3</displayName>
          <description>EPWM Dead-time Control Register 2/3</description>
          <addressOffset>0x74</addressOffset>
       </register>
       <register derivedFrom="EPWM_DTCTL0_1">
          <name>EPWM_DTCTL4_5</name>
          <displayName>EPWM_DTCTL4_5</displayName>
          <description>EPWM Dead-time Control Register 4/5</description>
          <addressOffset>0x78</addressOffset>
       </register>
       <register>
          <name>EPWM_PHS0_1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EPWM_PHS0_1</displayName>
          <description>EPWM Counter Phase Register 0/1</description>
          <addressOffset>0x80</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PHS</name>
              <description>EPWM Synchronous Start Phase Bits\nPHS determines the EPWM synchronous start phase value. These bits only use in synchronous function.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EPWM_PHS0_1">
          <name>EPWM_PHS2_3</name>
          <displayName>EPWM_PHS2_3</displayName>
          <description>EPWM Counter Phase Register 2/3</description>
          <addressOffset>0x84</addressOffset>
       </register>
       <register derivedFrom="EPWM_PHS0_1">
          <name>EPWM_PHS4_5</name>
          <displayName>EPWM_PHS4_5</displayName>
          <description>EPWM Counter Phase Register 4/5</description>
          <addressOffset>0x88</addressOffset>
       </register>
       <register>
          <name>EPWM_CNT0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EPWM_CNT0</displayName>
          <description>EPWM Counter Register 0</description>
          <addressOffset>0x90</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>EPWM Data Register (Read Only)\nUser can monitor CNT to know the current value in 16-bit period counter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIRF</name>
              <description>EPWM Direction Indicator Flag (Read Only)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Counter is counting down</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Counter is counting up</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EPWM_CNT0">
          <name>EPWM_CNT1</name>
          <displayName>EPWM_CNT1</displayName>
          <description>EPWM Counter Register 1</description>
          <addressOffset>0x94</addressOffset>
       </register>
       <register derivedFrom="EPWM_CNT0">
          <name>EPWM_CNT2</name>
          <displayName>EPWM_CNT2</displayName>
          <description>EPWM Counter Register 2</description>
          <addressOffset>0x98</addressOffset>
       </register>
       <register derivedFrom="EPWM_CNT0">
          <name>EPWM_CNT3</name>
          <displayName>EPWM_CNT3</displayName>
          <description>EPWM Counter Register 3</description>
          <addressOffset>0x9C</addressOffset>
       </register>
       <register derivedFrom="EPWM_CNT0">
          <name>EPWM_CNT4</name>
          <displayName>EPWM_CNT4</displayName>
          <description>EPWM Counter Register 4</description>
          <addressOffset>0xA0</addressOffset>
       </register>
       <register derivedFrom="EPWM_CNT0">
          <name>EPWM_CNT5</name>
          <displayName>EPWM_CNT5</displayName>
          <description>EPWM Counter Register 5</description>
          <addressOffset>0xA4</addressOffset>
       </register>
