iworx-systems/Zephyr-Dev-Container-Template/.devcontainer/M481_v1.svd
       <register>
          <name>EPWM_PBUF0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EPWM_PBUF0</displayName>
          <description>EPWM PERIOD0 Buffer</description>
          <addressOffset>0x304</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PBUF</name>
              <description>EPWM Period Register Buffer (Read Only)\nUsed as PERIOD active register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EPWM_PBUF0">
          <name>EPWM_PBUF1</name>
          <displayName>EPWM_PBUF1</displayName>
          <description>EPWM PERIOD1 Buffer</description>
          <addressOffset>0x308</addressOffset>
       </register>
       <register derivedFrom="EPWM_PBUF0">
          <name>EPWM_PBUF2</name>
          <displayName>EPWM_PBUF2</displayName>
          <description>EPWM PERIOD2 Buffer</description>
          <addressOffset>0x30C</addressOffset>
       </register>
       <register derivedFrom="EPWM_PBUF0">
          <name>EPWM_PBUF3</name>
          <displayName>EPWM_PBUF3</displayName>
          <description>EPWM PERIOD3 Buffer</description>
          <addressOffset>0x310</addressOffset>
       </register>
       <register derivedFrom="EPWM_PBUF0">
          <name>EPWM_PBUF4</name>
          <displayName>EPWM_PBUF4</displayName>
          <description>EPWM PERIOD4 Buffer</description>
          <addressOffset>0x314</addressOffset>
       </register>
       <register derivedFrom="EPWM_PBUF0">
          <name>EPWM_PBUF5</name>
          <displayName>EPWM_PBUF5</displayName>
          <description>EPWM PERIOD5 Buffer</description>
          <addressOffset>0x318</addressOffset>
       </register>
       <register>
          <name>EPWM_CMPBUF0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EPWM_CMPBUF0</displayName>
          <description>EPWM CMPDAT0 Buffer</description>
          <addressOffset>0x31C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMPBUF</name>
              <description>EPWM Comparator Register Buffer (Read Only)\nUsed as CMP active register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EPWM_CMPBUF0">
          <name>EPWM_CMPBUF1</name>
          <displayName>EPWM_CMPBUF1</displayName>
          <description>EPWM CMPDAT1 Buffer</description>
          <addressOffset>0x320</addressOffset>
       </register>
       <register derivedFrom="EPWM_CMPBUF0">
          <name>EPWM_CMPBUF2</name>
          <displayName>EPWM_CMPBUF2</displayName>
          <description>EPWM CMPDAT2 Buffer</description>
          <addressOffset>0x324</addressOffset>
       </register>
       <register derivedFrom="EPWM_CMPBUF0">
          <name>EPWM_CMPBUF3</name>
          <displayName>EPWM_CMPBUF3</displayName>
          <description>EPWM CMPDAT3 Buffer</description>
          <addressOffset>0x328</addressOffset>
       </register>
       <register derivedFrom="EPWM_CMPBUF0">
          <name>EPWM_CMPBUF4</name>
          <displayName>EPWM_CMPBUF4</displayName>
          <description>EPWM CMPDAT4 Buffer</description>
          <addressOffset>0x32C</addressOffset>
       </register>
       <register derivedFrom="EPWM_CMPBUF0">
          <name>EPWM_CMPBUF5</name>
          <displayName>EPWM_CMPBUF5</displayName>
          <description>EPWM CMPDAT5 Buffer</description>
          <addressOffset>0x330</addressOffset>
       </register>
       <register>
          <name>EPWM_CPSCBUF0_1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EPWM_CPSCBUF0_1</displayName>
          <description>EPWM CLKPSC0_1 Buffer</description>
          <addressOffset>0x334</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPSCBUF</name>
              <description>EPWM Counter Clock Prescale Buffer\nUsed as EPWM counter clock pre-scare active register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EPWM_CPSCBUF0_1">
          <name>EPWM_CPSCBUF2_3</name>
          <displayName>EPWM_CPSCBUF2_3</displayName>
          <description>EPWM CLKPSC2_3 Buffer</description>
          <addressOffset>0x338</addressOffset>
       </register>
       <register derivedFrom="EPWM_CPSCBUF0_1">
          <name>EPWM_CPSCBUF4_5</name>
          <displayName>EPWM_CPSCBUF4_5</displayName>
          <description>EPWM CLKPSC4_5 Buffer</description>
          <addressOffset>0x33C</addressOffset>
       </register>
       <register>
          <name>EPWM_FTCBUF0_1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EPWM_FTCBUF0_1</displayName>
          <description>EPWM FTCMPDAT0_1 Buffer</description>
          <addressOffset>0x340</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FTCMPBUF</name>
              <description>EPWM FTCMPDAT Buffer (Read Only)\nUsed as FTCMP active buffer.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
