iworx-systems/Zephyr-Dev-Container-Template/.devcontainer/M481_v1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SDH0</name>
      <description>SDH Register Map</description>
      <groupName>SDH</groupName>
      <baseAddress>0x4000D000</baseAddress>
      <!-- d -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x80</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x400</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x408</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x800</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x820</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>SDH_FB_0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_FB_0</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SB</name>
              <description>SDH Shared Buffer (FIFO)\nSingle 128 Bytes shared buffer for data exchange between system memory and cards.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="SDH_FB_0">
          <name>SDH_FB_1</name>
          <displayName>SDH_FB_1</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x4</addressOffset>
       </register>
       <register derivedFrom="SDH_FB_0">
          <name>SDH_FB_2</name>
          <displayName>SDH_FB_2</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x8</addressOffset>
       </register>
       <register derivedFrom="SDH_FB_0">
          <name>SDH_FB_3</name>
          <displayName>SDH_FB_3</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0xC</addressOffset>
       </register>
       <register derivedFrom="SDH_FB_0">
          <name>SDH_FB_4</name>
          <displayName>SDH_FB_4</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x10</addressOffset>
       </register>
       <register derivedFrom="SDH_FB_0">
          <name>SDH_FB_5</name>
          <displayName>SDH_FB_5</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x14</addressOffset>
       </register>
       <register derivedFrom="SDH_FB_0">
          <name>SDH_FB_6</name>
          <displayName>SDH_FB_6</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x18</addressOffset>
       </register>
       <register derivedFrom="SDH_FB_0">
          <name>SDH_FB_7</name>
          <displayName>SDH_FB_7</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x1C</addressOffset>
       </register>
       <register derivedFrom="SDH_FB_0">
          <name>SDH_FB_8</name>
          <displayName>SDH_FB_8</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x20</addressOffset>
       </register>
       <register derivedFrom="SDH_FB_0">
          <name>SDH_FB_9</name>
          <displayName>SDH_FB_9</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x24</addressOffset>
       </register>
       <register derivedFrom="SDH_FB_0">
          <name>SDH_FB_10</name>
          <displayName>SDH_FB_10</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x28</addressOffset>
       </register>
       <register derivedFrom="SDH_FB_0">
          <name>SDH_FB_11</name>
          <displayName>SDH_FB_11</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x2C</addressOffset>
       </register>
       <register derivedFrom="SDH_FB_0">
          <name>SDH_FB_12</name>
          <displayName>SDH_FB_12</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x30</addressOffset>
       </register>
       <register derivedFrom="SDH_FB_0">
          <name>SDH_FB_13</name>
          <displayName>SDH_FB_13</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x34</addressOffset>
       </register>
       <register derivedFrom="SDH_FB_0">
          <name>SDH_FB_14</name>
          <displayName>SDH_FB_14</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x38</addressOffset>
       </register>
       <register derivedFrom="SDH_FB_0">
          <name>SDH_FB_15</name>
          <displayName>SDH_FB_15</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x3C</addressOffset>
       </register>
       <register derivedFrom="SDH_FB_0">
          <name>SDH_FB_16</name>
          <displayName>SDH_FB_16</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x40</addressOffset>
       </register>
       <register derivedFrom="SDH_FB_0">
          <name>SDH_FB_17</name>
          <displayName>SDH_FB_17</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x44</addressOffset>
       </register>
       <register derivedFrom="SDH_FB_0">
          <name>SDH_FB_18</name>
          <displayName>SDH_FB_18</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x48</addressOffset>
       </register>
       <register derivedFrom="SDH_FB_0">
          <name>SDH_FB_19</name>
          <displayName>SDH_FB_19</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x4C</addressOffset>
       </register>
       <register derivedFrom="SDH_FB_0">
          <name>SDH_FB_20</name>
          <displayName>SDH_FB_20</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x50</addressOffset>
       </register>
       <register derivedFrom="SDH_FB_0">
          <name>SDH_FB_21</name>
          <displayName>SDH_FB_21</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x54</addressOffset>
       </register>
       <register derivedFrom="SDH_FB_0">
          <name>SDH_FB_22</name>
          <displayName>SDH_FB_22</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x58</addressOffset>
       </register>
       <register derivedFrom="SDH_FB_0">
          <name>SDH_FB_23</name>
          <displayName>SDH_FB_23</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x5C</addressOffset>
       </register>
       <register derivedFrom="SDH_FB_0">
          <name>SDH_FB_24</name>
          <displayName>SDH_FB_24</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x60</addressOffset>
       </register>
       <register derivedFrom="SDH_FB_0">
          <name>SDH_FB_25</name>
          <displayName>SDH_FB_25</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x64</addressOffset>
       </register>
       <register derivedFrom="SDH_FB_0">
          <name>SDH_FB_26</name>
          <displayName>SDH_FB_26</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x68</addressOffset>
       </register>
       <register derivedFrom="SDH_FB_0">
          <name>SDH_FB_27</name>
          <displayName>SDH_FB_27</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x6C</addressOffset>
       </register>
       <register derivedFrom="SDH_FB_0">
          <name>SDH_FB_28</name>
          <displayName>SDH_FB_28</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x70</addressOffset>
       </register>
       <register derivedFrom="SDH_FB_0">
          <name>SDH_FB_29</name>
          <displayName>SDH_FB_29</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x74</addressOffset>
       </register>
       <register derivedFrom="SDH_FB_0">
          <name>SDH_FB_30</name>
          <displayName>SDH_FB_30</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x78</addressOffset>
       </register>
       <register derivedFrom="SDH_FB_0">
          <name>SDH_FB_31</name>
          <displayName>SDH_FB_31</displayName>
          <description>Shared Buffer (FIFO)</description>
          <addressOffset>0x7C</addressOffset>
       </register>
       <register>
          <name>SDH_DMACTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_DMACTL</displayName>
          <description>DMA Control and Status Register</description>
          <addressOffset>0x400</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAEN</name>
              <description>DMA Engine Enable Bit\nNote 1: If this bit is cleared, DMA will ignore all requests from SD host and force bus master into IDLE state.\nNote 2: If target abort occurred, DMAEN will be cleared.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>DMA Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>DMA Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DMARST</name>
              <description>Software Engine Reset\nNote: The software reset DMA related registers.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reset internal state machine and pointers. The contents of control register will not be cleared. This bit will auto be cleared after few clock cycles</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SGEN</name>
              <description>Scatter-gather Function Enable Bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Scatter-gather function Disabled (DMA will treat the starting address in DMASAR as starting pointer of a single block memory)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Scatter-gather function Enabled (DMA will treat the starting address in DMASAR as a starting address of Physical Address Descriptor (PAD) table. The format of these Pads' will be described later)</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DMABUSY</name>
              <description>DMA Transfer Is in Progress\nThis bit indicates if SD Host is granted and doing DMA transfer or not.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>DMA transfer is not in progress</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>DMA transfer is in progress</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SDH_DMASA</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_DMASA</displayName>
          <description>DMA Transfer Starting Address Register</description>
          <addressOffset>0x408</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ORDER</name>
              <description>Determined to the PAD Table Fetching Is in Order or Out of Order</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PAD table is fetched in order</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PAD table is fetched out of order</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DMASA</name>
              <description>DMA Transfer Starting Address\nThis field pads 0 as least significant bit indicates a 32-bit starting address of system memory (SRAM) for DMA to retrieve or fill in data.\nIf DMA is not in normal mode, this field will be interpreted as a starting address of Physical Address Descriptor (PAD) table.\nNote: Starting address of the SRAM must be word aligned, for example, 0x0000_0000, 0x0000_0004.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SDH_DMABCNT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_DMABCNT</displayName>
          <description>DMA Transfer Byte Count Register</description>
          <addressOffset>0x40C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BCNT</name>
              <description>DMA Transfer Byte Count (Read Only)\nThis field indicates the remained byte count of DMA transfer. The value of this field is valid only when DMA is busy; otherwise, it is 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SDH_DMAINTEN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_DMAINTEN</displayName>
          <description>DMA Interrupt Enable Control Register</description>
          <addressOffset>0x410</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ABORTIEN</name>
              <description>DMA Read/Write Target Abort Interrupt Enable Bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Target abort interrupt generation Disabled during DMA transfer</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Target abort interrupt generation Enabled during DMA transfer</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>WEOTIEN</name>
              <description>Wrong EOT Encountered Interrupt Enable Bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Interrupt generation Disabled when wrong EOT is encountered</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Interrupt generation Enabled when wrong EOT is encountered</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SDH_DMAINTSTS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_DMAINTSTS</displayName>
          <description>DMA Interrupt Status Register</description>
          <addressOffset>0x414</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ABORTIF</name>
              <description>DMA Read/Write Target Abort Interrupt Flag (Read Only)\nNote 1: This bit is read only, but can be cleared by writing '1' to it.\nNote 2: When DMA's bus master received ERROR response, it means that target abort is happened. DMA will stop transfer and respond this event and then go to IDLE state. When target abort occurred or WEOTIF is set, software must reset DMA and SD host, and then transfer those data again.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No bus ERROR response received</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Bus ERROR response received</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>WEOTIF</name>
              <description>Wrong EOT Encountered Interrupt Flag (Read Only)\nWhen DMA Scatter-Gather function is enabled, and EOT of the descriptor is encountered before DMA transfer finished (that means the total sector count of all PAD is less than the sector count of SD host), this bit will be set.\nNote: This bit is read only, but can be cleared by writing '1' to it.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No EOT encountered before DMA transfer finished</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>EOT encountered before DMA transfer finished</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>SDH_GCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>SDH_GCTL</displayName>
          <description>Global Control and Status Register</description>
          <addressOffset>0x800</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GCTLRST</name>
              <description>Software Engine Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reset SD host. The contents of control register will not be cleared. This bit will auto cleared after reset complete</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SDEN</name>
              <description>Secure Digital Functionality Enable Bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>SD functionality Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SD functionality Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
