iworx-systems/Zephyr-Dev-Container-Template/.devcontainer/M481_v1.svd
       <register derivedFrom="USBD_MXPLD0">
          <name>USBD_MXPLD7</name>
          <displayName>USBD_MXPLD7</displayName>
          <description>Endpoint 7 Maximal Payload Register</description>
          <addressOffset>0x574</addressOffset>
       </register>
       <register derivedFrom="USBD_CFG0">
          <name>USBD_CFG7</name>
          <displayName>USBD_CFG7</displayName>
          <description>Endpoint 7 Configuration Register</description>
          <addressOffset>0x578</addressOffset>
       </register>
       <register derivedFrom="USBD_CFGP0">
          <name>USBD_CFGP7</name>
          <displayName>USBD_CFGP7</displayName>
          <description>Endpoint 7 Set Stall and Clear In/Out Ready Control Register</description>
          <addressOffset>0x57C</addressOffset>
       </register>
       <register derivedFrom="USBD_BUFSEG0">
          <name>USBD_BUFSEG8</name>
          <displayName>USBD_BUFSEG8</displayName>
          <description>Endpoint 8 Buffer Segmentation Register</description>
          <addressOffset>0x580</addressOffset>
       </register>
       <register derivedFrom="USBD_MXPLD0">
          <name>USBD_MXPLD8</name>
          <displayName>USBD_MXPLD8</displayName>
          <description>Endpoint 8 Maximal Payload Register</description>
          <addressOffset>0x584</addressOffset>
       </register>
       <register derivedFrom="USBD_CFG0">
          <name>USBD_CFG8</name>
          <displayName>USBD_CFG8</displayName>
          <description>Endpoint 8 Configuration Register</description>
          <addressOffset>0x588</addressOffset>
       </register>
       <register derivedFrom="USBD_CFGP0">
          <name>USBD_CFGP8</name>
          <displayName>USBD_CFGP8</displayName>
          <description>Endpoint 8 Set Stall and Clear In/Out Ready Control Register</description>
          <addressOffset>0x58C</addressOffset>
       </register>
       <register derivedFrom="USBD_BUFSEG0">
          <name>USBD_BUFSEG9</name>
          <displayName>USBD_BUFSEG9</displayName>
          <description>Endpoint 9 Buffer Segmentation Register</description>
          <addressOffset>0x590</addressOffset>
       </register>
       <register derivedFrom="USBD_MXPLD0">
          <name>USBD_MXPLD9</name>
          <displayName>USBD_MXPLD9</displayName>
          <description>Endpoint 9 Maximal Payload Register</description>
          <addressOffset>0x594</addressOffset>
       </register>
       <register derivedFrom="USBD_CFG0">
          <name>USBD_CFG9</name>
          <displayName>USBD_CFG9</displayName>
          <description>Endpoint 9 Configuration Register</description>
          <addressOffset>0x598</addressOffset>
       </register>
       <register derivedFrom="USBD_CFGP0">
          <name>USBD_CFGP9</name>
          <displayName>USBD_CFGP9</displayName>
          <description>Endpoint 9 Set Stall and Clear In/Out Ready Control Register</description>
          <addressOffset>0x59C</addressOffset>
       </register>
       <register derivedFrom="USBD_BUFSEG0">
          <name>USBD_BUFSEG10</name>
          <displayName>USBD_BUFSEG10</displayName>
          <description>Endpoint 10 Buffer Segmentation Register</description>
          <addressOffset>0x5A0</addressOffset>
       </register>
       <register derivedFrom="USBD_MXPLD0">
          <name>USBD_MXPLD10</name>
          <displayName>USBD_MXPLD10</displayName>
          <description>Endpoint 10 Maximal Payload Register</description>
          <addressOffset>0x5A4</addressOffset>
       </register>
       <register derivedFrom="USBD_CFG0">
          <name>USBD_CFG10</name>
          <displayName>USBD_CFG10</displayName>
          <description>Endpoint 10 Configuration Register</description>
          <addressOffset>0x5A8</addressOffset>
       </register>
       <register derivedFrom="USBD_CFGP0">
          <name>USBD_CFGP10</name>
          <displayName>USBD_CFGP10</displayName>
          <description>Endpoint 10 Set Stall and Clear In/Out Ready Control Register</description>
          <addressOffset>0x5AC</addressOffset>
       </register>
       <register derivedFrom="USBD_BUFSEG0">
          <name>USBD_BUFSEG11</name>
          <displayName>USBD_BUFSEG11</displayName>
          <description>Endpoint 11 Buffer Segmentation Register</description>
          <addressOffset>0x5B0</addressOffset>
       </register>
       <register derivedFrom="USBD_MXPLD0">
          <name>USBD_MXPLD11</name>
          <displayName>USBD_MXPLD11</displayName>
          <description>Endpoint 11 Maximal Payload Register</description>
          <addressOffset>0x5B4</addressOffset>
       </register>
       <register derivedFrom="USBD_CFG0">
          <name>USBD_CFG11</name>
          <displayName>USBD_CFG11</displayName>
          <description>Endpoint 11 Configuration Register</description>
          <addressOffset>0x5B8</addressOffset>
       </register>
       <register derivedFrom="USBD_CFGP0">
          <name>USBD_CFGP11</name>
          <displayName>USBD_CFGP11</displayName>
          <description>Endpoint 11 Set Stall and Clear In/Out Ready Control Register</description>
          <addressOffset>0x5BC</addressOffset>
       </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>HSUSBD</name>
      <description>USBD Register Map</description>
      <groupName>USBD</groupName>
      <baseAddress>0x40019000</baseAddress>
      <!-- d -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x234</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x700</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>HSUSBD_GINTSTS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>HSUSBD_GINTSTS</displayName>
          <description>Global Interrupt Status Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USBIF</name>
              <description>USB Interrupt \nThis bit conveys the interrupt status for USB specific events endpoint. When set, USB interrupt status register should be read to determine the cause of the interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No interrupt event occurred</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The related interrupt event occurred</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>CEPIF</name>
              <description>Control Endpoint Interrupt \nThis bit conveys the interrupt status for control endpoint. When set, Control-ep's interrupt status register should be read to determine the cause of the interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No interrupt event occurred</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The related interrupt event occurred</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>EPAIF</name>
              <description>Endpoint a Interrupt\nWhen set, the corresponding Endpoint A's interrupt status register should be read to determine the cause of the interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No interrupt event occurred</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The related interrupt event occurred</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>EPBIF</name>
              <description>Endpoint B Interrupt\nWhen set, the corresponding Endpoint B's interrupt status register should be read to determine the cause of the interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No interrupt event occurred</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The related interrupt event occurred</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>EPCIF</name>
              <description>Endpoint C Interrupt\nWhen set, the corresponding Endpoint C's interrupt status register should be read to determine the cause of the interrupt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No interrupt event occurred</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The related interrupt event occurred</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>EPDIF</name>
              <description>Endpoint D Interrupt\nWhen set, the corresponding Endpoint D's interrupt status register should be read to determine the cause of the interrupt.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No interrupt event occurred</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The related interrupt event occurred</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>EPEIF</name>
              <description>Endpoint E Interrupt\nWhen set, the corresponding Endpoint E's interrupt status register should be read to determine the cause of the interrupt.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No interrupt event occurred</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The related interrupt event occurred</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>EPFIF</name>
              <description>Endpoint F Interrupt\nWhen set, the corresponding Endpoint F's interrupt status register should be read to determine the cause of the interrupt.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No interrupt event occurred</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The related interrupt event occurred</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>EPGIF</name>
              <description>Endpoint G Interrupt\nWhen set, the corresponding Endpoint G's interrupt status register should be read to determine the cause of the interrupt.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No interrupt event occurred</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The related interrupt event occurred</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>EPHIF</name>
              <description>Endpoint H Interrupt\nWhen set, the corresponding Endpoint H's interrupt status register should be read to determine the cause of the interrupt.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No interrupt event occurred</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The related interrupt event occurred</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>EPIIF</name>
              <description>Endpoint I Interrupt\nWhen set, the corresponding Endpoint I's interrupt status register should be read to determine the cause of the interrupt.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No interrupt event occurred</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The related interrupt event occurred</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>EPJIF</name>
              <description>Endpoint J Interrupt\nWhen set, the corresponding Endpoint J's interrupt status register should be read to determine the cause of the interrupt.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No interrupt event occurred</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The related interrupt event occurred</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>EPKIF</name>
              <description>Endpoint K Interrupt\nWhen set, the corresponding Endpoint K's interrupt status register should be read to determine the cause of the interrupt.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No interrupt event occurred</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The related interrupt event occurred</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>EPLIF</name>
              <description>Endpoint L Interrupt\nWhen set, the corresponding Endpoint L's interrupt status register should be read to determine the cause of the interrupt.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No interrupt event occurred</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The related interrupt event occurred</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
