iworx-systems/Zephyr-Dev-Container-Template/.devcontainer/M481_v1.svd
       <register>
          <name>HSUSBD_EPACFG</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>HSUSBD_EPACFG</displayName>
          <description>Endpoint A Configuration Register</description>
          <addressOffset>0x80</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000012</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EPEN</name>
              <description>Endpoint Valid\nWhen set, this bit enables this endpoint. This bit has no effect on Endpoint 0, which is always enabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The endpoint Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The endpoint Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>EPTYPE</name>
              <description>Endpoint Type\nThis field selects the type of this endpoint. Endpoint 0 is forced to a Control type. </description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Reserved.</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Bulk</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Interrupt</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Isochronous</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>EPDIR</name>
              <description>Endpoint Direction\nNote: A maximum of one OUT and IN endpoint is allowed for each endpoint number.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>out-endpoint (Host OUT to Device)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>in-endpoint (Host IN to Device)</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>EPNUM</name>
              <description>Endpoint Number\nThis field selects the number of the endpoint. Valid numbers 1 to 15.\nNote: Do not support two endpoints have same endpoint number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>HSUSBD_EPABUFSTART</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>HSUSBD_EPABUFSTART</displayName>
          <description>Endpoint A RAM Start Address Register</description>
          <addressOffset>0x84</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SADDR</name>
              <description>Endpoint Start Address\nThis is the start-address of the RAM space allocated for the endpoint A~L.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>HSUSBD_EPABUFEND</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>HSUSBD_EPABUFEND</displayName>
          <description>Endpoint A RAM End Address Register</description>
          <addressOffset>0x88</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EADDR</name>
              <description>Endpoint End Address\nThis is the end-address of the RAM space allocated for the endpoint A~L.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="HSUSBD_EPADAT">
          <name>HSUSBD_EPBDAT</name>
          <displayName>HSUSBD_EPBDAT</displayName>
          <description>Endpoint B Data Register</description>
          <addressOffset>0x8C</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPAINTSTS">
          <name>HSUSBD_EPBINTSTS</name>
          <displayName>HSUSBD_EPBINTSTS</displayName>
          <description>Endpoint B Interrupt Status Register</description>
          <addressOffset>0x90</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPAINTEN">
          <name>HSUSBD_EPBINTEN</name>
          <displayName>HSUSBD_EPBINTEN</displayName>
          <description>Endpoint B Interrupt Enable Register</description>
          <addressOffset>0x94</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPADATCNT">
          <name>HSUSBD_EPBDATCNT</name>
          <displayName>HSUSBD_EPBDATCNT</displayName>
          <description>Endpoint B Data Available Count Register</description>
          <addressOffset>0x98</addressOffset>
       </register>
