iworx-systems/Zephyr-Dev-Container-Template/.devcontainer/M481_v1.svd
       <register derivedFrom="HSUSBD_EPARSPCTL">
          <name>HSUSBD_EPBRSPCTL</name>
          <displayName>HSUSBD_EPBRSPCTL</displayName>
          <description>Endpoint B Response Control Register</description>
          <addressOffset>0x9C</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPAMPS">
          <name>HSUSBD_EPBMPS</name>
          <displayName>HSUSBD_EPBMPS</displayName>
          <description>Endpoint B Maximum Packet Size Register</description>
          <addressOffset>0xA0</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPATXCNT">
          <name>HSUSBD_EPBTXCNT</name>
          <displayName>HSUSBD_EPBTXCNT</displayName>
          <description>Endpoint B Transfer Count Register</description>
          <addressOffset>0xA4</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPACFG">
          <name>HSUSBD_EPBCFG</name>
          <displayName>HSUSBD_EPBCFG</displayName>
          <description>Endpoint B Configuration Register</description>
          <addressOffset>0xA8</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPABUFSTART">
          <name>HSUSBD_EPBBUFSTART</name>
          <displayName>HSUSBD_EPBBUFSTART</displayName>
          <description>Endpoint B RAM Start Address Register</description>
          <addressOffset>0xAC</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPABUFEND">
          <name>HSUSBD_EPBBUFEND</name>
          <displayName>HSUSBD_EPBBUFEND</displayName>
          <description>Endpoint B RAM End Address Register</description>
          <addressOffset>0xB0</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPADAT">
          <name>HSUSBD_EPCDAT</name>
          <displayName>HSUSBD_EPCDAT</displayName>
          <description>Endpoint C Data Register</description>
          <addressOffset>0xB4</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPAINTSTS">
          <name>HSUSBD_EPCINTSTS</name>
          <displayName>HSUSBD_EPCINTSTS</displayName>
          <description>Endpoint C Interrupt Status Register</description>
          <addressOffset>0xB8</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPAINTEN">
          <name>HSUSBD_EPCINTEN</name>
          <displayName>HSUSBD_EPCINTEN</displayName>
          <description>Endpoint C Interrupt Enable Register</description>
          <addressOffset>0xBC</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPADATCNT">
          <name>HSUSBD_EPCDATCNT</name>
          <displayName>HSUSBD_EPCDATCNT</displayName>
          <description>Endpoint C Data Available Count Register</description>
          <addressOffset>0xC0</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPARSPCTL">
          <name>HSUSBD_EPCRSPCTL</name>
          <displayName>HSUSBD_EPCRSPCTL</displayName>
          <description>Endpoint C Response Control Register</description>
          <addressOffset>0xC4</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPAMPS">
          <name>HSUSBD_EPCMPS</name>
          <displayName>HSUSBD_EPCMPS</displayName>
          <description>Endpoint C Maximum Packet Size Register</description>
          <addressOffset>0xC8</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPATXCNT">
          <name>HSUSBD_EPCTXCNT</name>
          <displayName>HSUSBD_EPCTXCNT</displayName>
          <description>Endpoint C Transfer Count Register</description>
          <addressOffset>0xCC</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPACFG">
          <name>HSUSBD_EPCCFG</name>
          <displayName>HSUSBD_EPCCFG</displayName>
          <description>Endpoint C Configuration Register</description>
          <addressOffset>0xD0</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPABUFSTART">
          <name>HSUSBD_EPCBUFSTART</name>
          <displayName>HSUSBD_EPCBUFSTART</displayName>
          <description>Endpoint C RAM Start Address Register</description>
          <addressOffset>0xD4</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPABUFEND">
          <name>HSUSBD_EPCBUFEND</name>
          <displayName>HSUSBD_EPCBUFEND</displayName>
          <description>Endpoint C RAM End Address Register</description>
          <addressOffset>0xD8</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPADAT">
          <name>HSUSBD_EPDDAT</name>
          <displayName>HSUSBD_EPDDAT</displayName>
          <description>Endpoint D Data Register</description>
          <addressOffset>0xDC</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPAINTSTS">
          <name>HSUSBD_EPDINTSTS</name>
          <displayName>HSUSBD_EPDINTSTS</displayName>
          <description>Endpoint D Interrupt Status Register</description>
          <addressOffset>0xE0</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPAINTEN">
          <name>HSUSBD_EPDINTEN</name>
          <displayName>HSUSBD_EPDINTEN</displayName>
          <description>Endpoint D Interrupt Enable Register</description>
          <addressOffset>0xE4</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPADATCNT">
          <name>HSUSBD_EPDDATCNT</name>
          <displayName>HSUSBD_EPDDATCNT</displayName>
          <description>Endpoint D Data Available Count Register</description>
          <addressOffset>0xE8</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPARSPCTL">
          <name>HSUSBD_EPDRSPCTL</name>
          <displayName>HSUSBD_EPDRSPCTL</displayName>
          <description>Endpoint D Response Control Register</description>
          <addressOffset>0xEC</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPAMPS">
          <name>HSUSBD_EPDMPS</name>
          <displayName>HSUSBD_EPDMPS</displayName>
          <description>Endpoint D Maximum Packet Size Register</description>
          <addressOffset>0xF0</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPATXCNT">
          <name>HSUSBD_EPDTXCNT</name>
          <displayName>HSUSBD_EPDTXCNT</displayName>
          <description>Endpoint D Transfer Count Register</description>
          <addressOffset>0xF4</addressOffset>
       </register>
