iworx-systems/Zephyr-Dev-Container-Template/.devcontainer/M481_v1.svd
       <register derivedFrom="HSUSBD_EPACFG">
          <name>HSUSBD_EPDCFG</name>
          <displayName>HSUSBD_EPDCFG</displayName>
          <description>Endpoint D Configuration Register</description>
          <addressOffset>0xF8</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPABUFSTART">
          <name>HSUSBD_EPDBUFSTART</name>
          <displayName>HSUSBD_EPDBUFSTART</displayName>
          <description>Endpoint D RAM Start Address Register</description>
          <addressOffset>0xFC</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPABUFEND">
          <name>HSUSBD_EPDBUFEND</name>
          <displayName>HSUSBD_EPDBUFEND</displayName>
          <description>Endpoint D RAM End Address Register</description>
          <addressOffset>0x100</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPADAT">
          <name>HSUSBD_EPEDAT</name>
          <displayName>HSUSBD_EPEDAT</displayName>
          <description>Endpoint E Data Register</description>
          <addressOffset>0x104</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPAINTSTS">
          <name>HSUSBD_EPEINTSTS</name>
          <displayName>HSUSBD_EPEINTSTS</displayName>
          <description>Endpoint E Interrupt Status Register</description>
          <addressOffset>0x108</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPAINTEN">
          <name>HSUSBD_EPEINTEN</name>
          <displayName>HSUSBD_EPEINTEN</displayName>
          <description>Endpoint E Interrupt Enable Register</description>
          <addressOffset>0x10C</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPADATCNT">
          <name>HSUSBD_EPEDATCNT</name>
          <displayName>HSUSBD_EPEDATCNT</displayName>
          <description>Endpoint E Data Available Count Register</description>
          <addressOffset>0x110</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPARSPCTL">
          <name>HSUSBD_EPERSPCTL</name>
          <displayName>HSUSBD_EPERSPCTL</displayName>
          <description>Endpoint E Response Control Register</description>
          <addressOffset>0x114</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPAMPS">
          <name>HSUSBD_EPEMPS</name>
          <displayName>HSUSBD_EPEMPS</displayName>
          <description>Endpoint E Maximum Packet Size Register</description>
          <addressOffset>0x118</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPATXCNT">
          <name>HSUSBD_EPETXCNT</name>
          <displayName>HSUSBD_EPETXCNT</displayName>
          <description>Endpoint E Transfer Count Register</description>
          <addressOffset>0x11C</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPACFG">
          <name>HSUSBD_EPECFG</name>
          <displayName>HSUSBD_EPECFG</displayName>
          <description>Endpoint E Configuration Register</description>
          <addressOffset>0x120</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPABUFSTART">
          <name>HSUSBD_EPEBUFSTART</name>
          <displayName>HSUSBD_EPEBUFSTART</displayName>
          <description>Endpoint E RAM Start Address Register</description>
          <addressOffset>0x124</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPABUFEND">
          <name>HSUSBD_EPEBUFEND</name>
          <displayName>HSUSBD_EPEBUFEND</displayName>
          <description>Endpoint E RAM End Address Register</description>
          <addressOffset>0x128</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPADAT">
          <name>HSUSBD_EPFDAT</name>
          <displayName>HSUSBD_EPFDAT</displayName>
          <description>Endpoint F Data Register</description>
          <addressOffset>0x12C</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPAINTSTS">
          <name>HSUSBD_EPFINTSTS</name>
          <displayName>HSUSBD_EPFINTSTS</displayName>
          <description>Endpoint F Interrupt Status Register</description>
          <addressOffset>0x130</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPAINTEN">
          <name>HSUSBD_EPFINTEN</name>
          <displayName>HSUSBD_EPFINTEN</displayName>
          <description>Endpoint F Interrupt Enable Register</description>
          <addressOffset>0x134</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPADATCNT">
          <name>HSUSBD_EPFDATCNT</name>
          <displayName>HSUSBD_EPFDATCNT</displayName>
          <description>Endpoint F Data Available Count Register</description>
          <addressOffset>0x138</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPARSPCTL">
          <name>HSUSBD_EPFRSPCTL</name>
          <displayName>HSUSBD_EPFRSPCTL</displayName>
          <description>Endpoint F Response Control Register</description>
          <addressOffset>0x13C</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPAMPS">
          <name>HSUSBD_EPFMPS</name>
          <displayName>HSUSBD_EPFMPS</displayName>
          <description>Endpoint F Maximum Packet Size Register</description>
          <addressOffset>0x140</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPATXCNT">
          <name>HSUSBD_EPFTXCNT</name>
          <displayName>HSUSBD_EPFTXCNT</displayName>
          <description>Endpoint F Transfer Count Register</description>
          <addressOffset>0x144</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPACFG">
          <name>HSUSBD_EPFCFG</name>
          <displayName>HSUSBD_EPFCFG</displayName>
          <description>Endpoint F Configuration Register</description>
          <addressOffset>0x148</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPABUFSTART">
          <name>HSUSBD_EPFBUFSTART</name>
          <displayName>HSUSBD_EPFBUFSTART</displayName>
          <description>Endpoint F RAM Start Address Register</description>
          <addressOffset>0x14C</addressOffset>
       </register>
