iworx-systems/Zephyr-Dev-Container-Template/.devcontainer/M481_v1.svd
       <register derivedFrom="HSUSBD_EPARSPCTL">
          <name>HSUSBD_EPIRSPCTL</name>
          <displayName>HSUSBD_EPIRSPCTL</displayName>
          <description>Endpoint I Response Control Register</description>
          <addressOffset>0x1B4</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPAMPS">
          <name>HSUSBD_EPIMPS</name>
          <displayName>HSUSBD_EPIMPS</displayName>
          <description>Endpoint I Maximum Packet Size Register</description>
          <addressOffset>0x1B8</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPATXCNT">
          <name>HSUSBD_EPITXCNT</name>
          <displayName>HSUSBD_EPITXCNT</displayName>
          <description>Endpoint I Transfer Count Register</description>
          <addressOffset>0x1BC</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPACFG">
          <name>HSUSBD_EPICFG</name>
          <displayName>HSUSBD_EPICFG</displayName>
          <description>Endpoint I Configuration Register</description>
          <addressOffset>0x1C0</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPABUFSTART">
          <name>HSUSBD_EPIBUFSTART</name>
          <displayName>HSUSBD_EPIBUFSTART</displayName>
          <description>Endpoint I RAM Start Address Register</description>
          <addressOffset>0x1C4</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPABUFEND">
          <name>HSUSBD_EPIBUFEND</name>
          <displayName>HSUSBD_EPIBUFEND</displayName>
          <description>Endpoint I RAM End Address Register</description>
          <addressOffset>0x1C8</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPADAT">
          <name>HSUSBD_EPJDAT</name>
          <displayName>HSUSBD_EPJDAT</displayName>
          <description>Endpoint J Data Register</description>
          <addressOffset>0x1CC</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPAINTSTS">
          <name>HSUSBD_EPJINTSTS</name>
          <displayName>HSUSBD_EPJINTSTS</displayName>
          <description>Endpoint J Interrupt Status Register</description>
          <addressOffset>0x1D0</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPAINTEN">
          <name>HSUSBD_EPJINTEN</name>
          <displayName>HSUSBD_EPJINTEN</displayName>
          <description>Endpoint J Interrupt Enable Register</description>
          <addressOffset>0x1D4</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPADATCNT">
          <name>HSUSBD_EPJDATCNT</name>
          <displayName>HSUSBD_EPJDATCNT</displayName>
          <description>Endpoint J Data Available Count Register</description>
          <addressOffset>0x1D8</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPARSPCTL">
          <name>HSUSBD_EPJRSPCTL</name>
          <displayName>HSUSBD_EPJRSPCTL</displayName>
          <description>Endpoint J Response Control Register</description>
          <addressOffset>0x1DC</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPAMPS">
          <name>HSUSBD_EPJMPS</name>
          <displayName>HSUSBD_EPJMPS</displayName>
          <description>Endpoint J Maximum Packet Size Register</description>
          <addressOffset>0x1E0</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPATXCNT">
          <name>HSUSBD_EPJTXCNT</name>
          <displayName>HSUSBD_EPJTXCNT</displayName>
          <description>Endpoint J Transfer Count Register</description>
          <addressOffset>0x1E4</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPACFG">
          <name>HSUSBD_EPJCFG</name>
          <displayName>HSUSBD_EPJCFG</displayName>
          <description>Endpoint J Configuration Register</description>
          <addressOffset>0x1E8</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPABUFSTART">
          <name>HSUSBD_EPJBUFSTART</name>
          <displayName>HSUSBD_EPJBUFSTART</displayName>
          <description>Endpoint J RAM Start Address Register</description>
          <addressOffset>0x1EC</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPABUFEND">
          <name>HSUSBD_EPJBUFEND</name>
          <displayName>HSUSBD_EPJBUFEND</displayName>
          <description>Endpoint J RAM End Address Register</description>
          <addressOffset>0x1F0</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPADAT">
          <name>HSUSBD_EPKDAT</name>
          <displayName>HSUSBD_EPKDAT</displayName>
          <description>Endpoint K Data Register</description>
          <addressOffset>0x1F4</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPAINTSTS">
          <name>HSUSBD_EPKINTSTS</name>
          <displayName>HSUSBD_EPKINTSTS</displayName>
          <description>Endpoint K Interrupt Status Register</description>
          <addressOffset>0x1F8</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPAINTEN">
          <name>HSUSBD_EPKINTEN</name>
          <displayName>HSUSBD_EPKINTEN</displayName>
          <description>Endpoint K Interrupt Enable Register</description>
          <addressOffset>0x1FC</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPADATCNT">
          <name>HSUSBD_EPKDATCNT</name>
          <displayName>HSUSBD_EPKDATCNT</displayName>
          <description>Endpoint K Data Available Count Register</description>
          <addressOffset>0x200</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPARSPCTL">
          <name>HSUSBD_EPKRSPCTL</name>
          <displayName>HSUSBD_EPKRSPCTL</displayName>
          <description>Endpoint K Response Control Register</description>
          <addressOffset>0x204</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPAMPS">
          <name>HSUSBD_EPKMPS</name>
          <displayName>HSUSBD_EPKMPS</displayName>
          <description>Endpoint K Maximum Packet Size Register</description>
          <addressOffset>0x208</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPATXCNT">
          <name>HSUSBD_EPKTXCNT</name>
          <displayName>HSUSBD_EPKTXCNT</displayName>
          <description>Endpoint K Transfer Count Register</description>
          <addressOffset>0x20C</addressOffset>
       </register>
