iworx-systems/Zephyr-Dev-Container-Template/.devcontainer/M481_v1.svd
       <register>
          <name>CRYPTO_AES_STS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_AES_STS</displayName>
          <description>AES Engine Flag</description>
          <addressOffset>0x104</addressOffset>
          <access>read-only</access>
          <resetValue>0x00010100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BUSY</name>
              <description>AES Engine Busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The AES engine is idle or finished</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The AES engine is under processing</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>INBUFEMPTY</name>
              <description>AES Input Buffer Empty</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>There are some data in input buffer waiting for the AES engine to process</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>AES input buffer is empty. Software needs to feed data to the AES engine. Otherwise, the AES engine will be pending to wait for input data</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>INBUFFULL</name>
              <description>AES Input Buffer Full Flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>AES input buffer is not full. Software can feed the data into the AES engine</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>AES input buffer is full. Software cannot feed data to the AES engine. Otherwise, the flag INBUFERR will be set to 1</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>INBUFERR</name>
              <description>AES Input Buffer Error Flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Error happens during feeding data to the AES engine</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>CNTERR</name>
              <description>CRYPTO_AESn_CNT Setting Error</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No error in CRYPTO_AESn_CNT setting</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>CRYPTO_AESn_CNT is 0 if DMAEN(CRYPTO_AES_CTL[7]) is enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTBUFEMPTY</name>
              <description>AES Out Buffer Empty</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>AES output buffer is not empty. There are some valid data kept in output buffer</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>AES output buffer is empty. Software cannot get data from CRYPTO_AES_DATOUT. Otherwise, the flag OUTBUFERR will be set to 1 since the output buffer is empty</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTBUFFULL</name>
              <description>AES Out Buffer Full Flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>AES output buffer is not full</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>AES output buffer is full, and software needs to get data from CRYPTO_AES_DATOUT. Otherwise, the AES engine will be pending since the output buffer is full</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTBUFERR</name>
              <description>AES Out Buffer Error Flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Error happens during getting the result from AES engine</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSERR</name>
              <description>AES DMA Access Bus Error Flag</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Bus error will stop DMA operation and AES engine</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_AES_DATIN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_AES_DATIN</displayName>
          <description>AES Engine Data Input Port Register</description>
          <addressOffset>0x108</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATIN</name>
              <description>AES Engine Input Port\nCPU feeds data to AES engine through this port by checking CRYPTO_AES_STS. Feed data when INBUFFULL is 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_AES_DATOUT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_AES_DATOUT</displayName>
          <description>AES Engine Data Output Port Register</description>
          <addressOffset>0x10C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATOUT</name>
              <description>AES Engine Output Port\nCPU gets results from the AES engine through this port by checking CRYPTO_AES_STS. Get data when OUTBUFEMPTY is 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_AES0_KEY0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_AES0_KEY0</displayName>
          <description>AES Key Word 0 Register for Channel 0</description>
          <addressOffset>0x110</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEY</name>
              <description>CRYPTO_AESn_KEYx\nThe KEY keeps the security key for AES operation.\n{CRYPTO_AESn_KEY3, CRYPTO_AESn_KEY2, CRYPTO_AESn_KEY1, CRYPTO_AESn_KEY0} stores the 128-bit security key for AES operation. \n{CRYPTO_AESn_KEY5, CRYPTO_AESn_KEY4, CRYPTO_AESn_KEY3, CRYPTO_AESn_KEY2, CRYPTO_AESn_KEY1, CRYPTO_AESn_KEY0} stores the 192-bit security key for AES operation. \n{CRYPTO_AESn_KEY7, CRYPTO_AESn_KEY6, CRYPTO_AESn_KEY5, CRYPTO_AESn_KEY4, CRYPTO_AESn_KEY3, CRYPTO_AESn_KEY2, CRYPTO_AESn_KEY1, CRYPTO_AESn_KEY0} stores the 256-bit security key for AES operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_AES0_KEY0">
          <name>CRYPTO_AES0_KEY1</name>
          <displayName>CRYPTO_AES0_KEY1</displayName>
          <description>AES Key Word 1 Register for Channel 0</description>
          <addressOffset>0x114</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_KEY0">
          <name>CRYPTO_AES0_KEY2</name>
          <displayName>CRYPTO_AES0_KEY2</displayName>
          <description>AES Key Word 2 Register for Channel 0</description>
          <addressOffset>0x118</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_KEY0">
          <name>CRYPTO_AES0_KEY3</name>
          <displayName>CRYPTO_AES0_KEY3</displayName>
          <description>AES Key Word 3 Register for Channel 0</description>
          <addressOffset>0x11C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_KEY0">
          <name>CRYPTO_AES0_KEY4</name>
          <displayName>CRYPTO_AES0_KEY4</displayName>
          <description>AES Key Word 4 Register for Channel 0</description>
          <addressOffset>0x120</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_KEY0">
          <name>CRYPTO_AES0_KEY5</name>
          <displayName>CRYPTO_AES0_KEY5</displayName>
          <description>AES Key Word 5 Register for Channel 0</description>
          <addressOffset>0x124</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_KEY0">
          <name>CRYPTO_AES0_KEY6</name>
          <displayName>CRYPTO_AES0_KEY6</displayName>
          <description>AES Key Word 6 Register for Channel 0</description>
          <addressOffset>0x128</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_KEY0">
          <name>CRYPTO_AES0_KEY7</name>
          <displayName>CRYPTO_AES0_KEY7</displayName>
          <description>AES Key Word 7 Register for Channel 0</description>
          <addressOffset>0x12C</addressOffset>
       </register>
       <register>
          <name>CRYPTO_AES0_IV0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_AES0_IV0</displayName>
          <description>AES Initial Vector Word 0 Register for Channel 0</description>
          <addressOffset>0x130</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IV</name>
              <description>AES Initial Vectors\nFour initial vectors (CRYPTO_AESn_IV0, CRYPTO_AESn_IV1, CRYPTO_AESn_IV2, and CRYPTO_AESn_IV3) are for AES operating in CBC, CFB, and OFB mode. Four registers (CRYPTO_AESn_IV0, CRYPTO_AESn_IV1, CRYPTO_AESn_IV2, and CRYPTO_AESn_IV3) act as Nonce counter when the AES engine is operating in CTR mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_AES0_IV0">
          <name>CRYPTO_AES0_IV1</name>
          <displayName>CRYPTO_AES0_IV1</displayName>
          <description>AES Initial Vector Word 1 Register for Channel 0</description>
          <addressOffset>0x134</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_IV0">
          <name>CRYPTO_AES0_IV2</name>
          <displayName>CRYPTO_AES0_IV2</displayName>
          <description>AES Initial Vector Word 2 Register for Channel 0</description>
          <addressOffset>0x138</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_IV0">
          <name>CRYPTO_AES0_IV3</name>
          <displayName>CRYPTO_AES0_IV3</displayName>
          <description>AES Initial Vector Word 3 Register for Channel 0</description>
          <addressOffset>0x13C</addressOffset>
       </register>
       <register>
          <name>CRYPTO_AES0_SADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_AES0_SADDR</displayName>
          <description>AES DMA Source Address Register for Channel 0</description>
          <addressOffset>0x140</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SADDR</name>
              <description>AES DMA Source Address\nThe AES accelerator supports DMA function to transfer the plain text between SRAM memory space and embedded FIFO. The SADDR keeps the source address of the data buffer where the source text is stored. Based on the source address, the AES accelerator can read the plain text (encryption) / cipher text (descryption) from SRAM memory space and do AES operation. The start of source address should be located at word boundary. In other words, bit 1 and 0 of SADDR are ignored.\nSADDR can be read and written. Writing to SADDR while the AES accelerator is operating doesn't affect the current AES operation. But the value of SADDR will be updated later on. Consequently, software can prepare the DMA source address for the next AES operation.\nIn DMA mode, software can update the next CRYPTO_AESn_SADDR before triggering START.\nThe value of CRYPTO_AESn_SADDR and CRYPTO_AESn_DADDR can be the same.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_AES0_DADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_AES0_DADDR</displayName>
          <description>AES DMA Destination Address Register for Channel 0</description>
          <addressOffset>0x144</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DADDR</name>
              <description>AES DMA Destination Address\nThe AES accelerator supports DMA function to transfer the cipher text between SRAM memory space and embedded FIFO. The DADDR keeps the destination address of the data buffer where the engine output's text will be stored. Based on the destination address, the AES accelerator can write the cipher text (encryption) / plain text (decryption) back to SRAM memory space after the AES operation is finished. The start of destination address should be located at word boundary. In other words, bit 1 and 0 of DADDR are ignored.\nDADDR can be read and written. Writing to DADDR while the AES accelerator is operating doesn't affect the current AES operation. But the value of DADDR will be updated later on. Consequently, software can prepare the destination address for the next AES operation.\nIn DMA mode, software can update the next CRYPTO_AESn_DADDR before triggering START. \nThe value of CRYPTO_AESn_SADDR and CRYPTO_AESn_DADDR can be the same.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_AES0_CNT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_AES0_CNT</displayName>
          <description>AES Byte Count Register for Channel 0</description>
          <addressOffset>0x148</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>AES Byte Count\nThe CRYPTO_AESn_CNT keeps the byte count of source text that is for the AES engine operating in DMA mode. The CRYPTO_AESn_CNT is 32-bit and the maximum of byte count is 4G bytes.\nCRYPTO_AESn_CNT can be read and written. Writing to CRYPTO_AESn_CNT while the AES accelerator is operating doesn't affect the current AES operation. But the value of CRYPTO_AESn_CNT will be updated later on. Consequently, software can prepare the byte count of data for the next AES operation.\nAccording to CBC-CS1, CBC-CS2, and CBC-CS3 standard, the count of operation data must be more than 16 bytes. Operations that are qual or less than one block will output unexpected result.\nIn Non-DMA ECB, CBC, CFB, OFB, and CTR mode, CRYPTO_AESn_CNT must be set as byte count for the last block of data before feeding in the last block of data. In Non-DMA CBC-CS1, CBC-CS2, and CBC-CS3 mode, CRYPTO_AESn_CNT must be set as byte count for the last two blocks of data before feeding in the last two blocks of data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_AES0_KEY0">
          <name>CRYPTO_AES1_KEY0</name>
          <displayName>CRYPTO_AES1_KEY0</displayName>
          <description>AES Key Word 0 Register for Channel 1</description>
          <addressOffset>0x14C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_KEY0">
          <name>CRYPTO_AES1_KEY1</name>
          <displayName>CRYPTO_AES1_KEY1</displayName>
          <description>AES Key Word 1 Register for Channel 1</description>
          <addressOffset>0x150</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_KEY0">
          <name>CRYPTO_AES1_KEY2</name>
          <displayName>CRYPTO_AES1_KEY2</displayName>
          <description>AES Key Word 2 Register for Channel 1</description>
          <addressOffset>0x154</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_KEY0">
          <name>CRYPTO_AES1_KEY3</name>
          <displayName>CRYPTO_AES1_KEY3</displayName>
          <description>AES Key Word 3 Register for Channel 1</description>
          <addressOffset>0x158</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_KEY0">
          <name>CRYPTO_AES1_KEY4</name>
          <displayName>CRYPTO_AES1_KEY4</displayName>
          <description>AES Key Word 4 Register for Channel 1</description>
          <addressOffset>0x15C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_KEY0">
          <name>CRYPTO_AES1_KEY5</name>
          <displayName>CRYPTO_AES1_KEY5</displayName>
          <description>AES Key Word 5 Register for Channel 1</description>
          <addressOffset>0x160</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_KEY0">
          <name>CRYPTO_AES1_KEY6</name>
          <displayName>CRYPTO_AES1_KEY6</displayName>
          <description>AES Key Word 6 Register for Channel 1</description>
          <addressOffset>0x164</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_KEY0">
          <name>CRYPTO_AES1_KEY7</name>
          <displayName>CRYPTO_AES1_KEY7</displayName>
          <description>AES Key Word 7 Register for Channel 1</description>
          <addressOffset>0x168</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_IV0">
          <name>CRYPTO_AES1_IV0</name>
          <displayName>CRYPTO_AES1_IV0</displayName>
          <description>AES Initial Vector Word 0 Register for Channel 1</description>
          <addressOffset>0x16C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_IV0">
          <name>CRYPTO_AES1_IV1</name>
          <displayName>CRYPTO_AES1_IV1</displayName>
          <description>AES Initial Vector Word 1 Register for Channel 1</description>
          <addressOffset>0x170</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_IV0">
          <name>CRYPTO_AES1_IV2</name>
          <displayName>CRYPTO_AES1_IV2</displayName>
          <description>AES Initial Vector Word 2 Register for Channel 1</description>
          <addressOffset>0x174</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_IV0">
          <name>CRYPTO_AES1_IV3</name>
          <displayName>CRYPTO_AES1_IV3</displayName>
          <description>AES Initial Vector Word 3 Register for Channel 1</description>
          <addressOffset>0x178</addressOffset>
       </register>
