iworx-systems/Zephyr-Dev-Container-Template/.devcontainer/M481_v1.svd
       <register derivedFrom="CRYPTO_AES0_SADDR">
          <name>CRYPTO_AES1_SADDR</name>
          <displayName>CRYPTO_AES1_SADDR</displayName>
          <description>AES DMA Source Address Register for Channel 1</description>
          <addressOffset>0x17C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_DADDR">
          <name>CRYPTO_AES1_DADDR</name>
          <displayName>CRYPTO_AES1_DADDR</displayName>
          <description>AES DMA Destination Address Register for Channel 1</description>
          <addressOffset>0x180</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_CNT">
          <name>CRYPTO_AES1_CNT</name>
          <displayName>CRYPTO_AES1_CNT</displayName>
          <description>AES Byte Count Register for Channel 1</description>
          <addressOffset>0x184</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_KEY0">
          <name>CRYPTO_AES2_KEY0</name>
          <displayName>CRYPTO_AES2_KEY0</displayName>
          <description>AES Key Word 0 Register for Channel 2</description>
          <addressOffset>0x188</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_KEY0">
          <name>CRYPTO_AES2_KEY1</name>
          <displayName>CRYPTO_AES2_KEY1</displayName>
          <description>AES Key Word 1 Register for Channel 2</description>
          <addressOffset>0x18C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_KEY0">
          <name>CRYPTO_AES2_KEY2</name>
          <displayName>CRYPTO_AES2_KEY2</displayName>
          <description>AES Key Word 2 Register for Channel 2</description>
          <addressOffset>0x190</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_KEY0">
          <name>CRYPTO_AES2_KEY3</name>
          <displayName>CRYPTO_AES2_KEY3</displayName>
          <description>AES Key Word 3 Register for Channel 2</description>
          <addressOffset>0x194</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_KEY0">
          <name>CRYPTO_AES2_KEY4</name>
          <displayName>CRYPTO_AES2_KEY4</displayName>
          <description>AES Key Word 4 Register for Channel 2</description>
          <addressOffset>0x198</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_KEY0">
          <name>CRYPTO_AES2_KEY5</name>
          <displayName>CRYPTO_AES2_KEY5</displayName>
          <description>AES Key Word 5 Register for Channel 2</description>
          <addressOffset>0x19C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_KEY0">
          <name>CRYPTO_AES2_KEY6</name>
          <displayName>CRYPTO_AES2_KEY6</displayName>
          <description>AES Key Word 6 Register for Channel 2</description>
          <addressOffset>0x1A0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_KEY0">
          <name>CRYPTO_AES2_KEY7</name>
          <displayName>CRYPTO_AES2_KEY7</displayName>
          <description>AES Key Word 7 Register for Channel 2</description>
          <addressOffset>0x1A4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_IV0">
          <name>CRYPTO_AES2_IV0</name>
          <displayName>CRYPTO_AES2_IV0</displayName>
          <description>AES Initial Vector Word 0 Register for Channel 2</description>
          <addressOffset>0x1A8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_IV0">
          <name>CRYPTO_AES2_IV1</name>
          <displayName>CRYPTO_AES2_IV1</displayName>
          <description>AES Initial Vector Word 1 Register for Channel 2</description>
          <addressOffset>0x1AC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_IV0">
          <name>CRYPTO_AES2_IV2</name>
          <displayName>CRYPTO_AES2_IV2</displayName>
          <description>AES Initial Vector Word 2 Register for Channel 2</description>
          <addressOffset>0x1B0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_IV0">
          <name>CRYPTO_AES2_IV3</name>
          <displayName>CRYPTO_AES2_IV3</displayName>
          <description>AES Initial Vector Word 3 Register for Channel 2</description>
          <addressOffset>0x1B4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_SADDR">
          <name>CRYPTO_AES2_SADDR</name>
          <displayName>CRYPTO_AES2_SADDR</displayName>
          <description>AES DMA Source Address Register for Channel 2</description>
          <addressOffset>0x1B8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_DADDR">
          <name>CRYPTO_AES2_DADDR</name>
          <displayName>CRYPTO_AES2_DADDR</displayName>
          <description>AES DMA Destination Address Register for Channel 2</description>
          <addressOffset>0x1BC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_CNT">
          <name>CRYPTO_AES2_CNT</name>
          <displayName>CRYPTO_AES2_CNT</displayName>
          <description>AES Byte Count Register for Channel 2</description>
          <addressOffset>0x1C0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_KEY0">
          <name>CRYPTO_AES3_KEY0</name>
          <displayName>CRYPTO_AES3_KEY0</displayName>
          <description>AES Key Word 0 Register for Channel 3</description>
          <addressOffset>0x1C4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_KEY0">
          <name>CRYPTO_AES3_KEY1</name>
          <displayName>CRYPTO_AES3_KEY1</displayName>
          <description>AES Key Word 1 Register for Channel 3</description>
          <addressOffset>0x1C8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_KEY0">
          <name>CRYPTO_AES3_KEY2</name>
          <displayName>CRYPTO_AES3_KEY2</displayName>
          <description>AES Key Word 2 Register for Channel 3</description>
          <addressOffset>0x1CC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_KEY0">
          <name>CRYPTO_AES3_KEY3</name>
          <displayName>CRYPTO_AES3_KEY3</displayName>
          <description>AES Key Word 3 Register for Channel 3</description>
          <addressOffset>0x1D0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_KEY0">
          <name>CRYPTO_AES3_KEY4</name>
          <displayName>CRYPTO_AES3_KEY4</displayName>
          <description>AES Key Word 4 Register for Channel 3</description>
          <addressOffset>0x1D4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_KEY0">
          <name>CRYPTO_AES3_KEY5</name>
          <displayName>CRYPTO_AES3_KEY5</displayName>
          <description>AES Key Word 5 Register for Channel 3</description>
          <addressOffset>0x1D8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_KEY0">
          <name>CRYPTO_AES3_KEY6</name>
          <displayName>CRYPTO_AES3_KEY6</displayName>
          <description>AES Key Word 6 Register for Channel 3</description>
          <addressOffset>0x1DC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_KEY0">
          <name>CRYPTO_AES3_KEY7</name>
          <displayName>CRYPTO_AES3_KEY7</displayName>
          <description>AES Key Word 7 Register for Channel 3</description>
          <addressOffset>0x1E0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_IV0">
          <name>CRYPTO_AES3_IV0</name>
          <displayName>CRYPTO_AES3_IV0</displayName>
          <description>AES Initial Vector Word 0 Register for Channel 3</description>
          <addressOffset>0x1E4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_IV0">
          <name>CRYPTO_AES3_IV1</name>
          <displayName>CRYPTO_AES3_IV1</displayName>
          <description>AES Initial Vector Word 1 Register for Channel 3</description>
          <addressOffset>0x1E8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_IV0">
          <name>CRYPTO_AES3_IV2</name>
          <displayName>CRYPTO_AES3_IV2</displayName>
          <description>AES Initial Vector Word 2 Register for Channel 3</description>
          <addressOffset>0x1EC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_IV0">
          <name>CRYPTO_AES3_IV3</name>
          <displayName>CRYPTO_AES3_IV3</displayName>
          <description>AES Initial Vector Word 3 Register for Channel 3</description>
          <addressOffset>0x1F0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_SADDR">
          <name>CRYPTO_AES3_SADDR</name>
          <displayName>CRYPTO_AES3_SADDR</displayName>
          <description>AES DMA Source Address Register for Channel 3</description>
          <addressOffset>0x1F4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_DADDR">
          <name>CRYPTO_AES3_DADDR</name>
          <displayName>CRYPTO_AES3_DADDR</displayName>
          <description>AES DMA Destination Address Register for Channel 3</description>
          <addressOffset>0x1F8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_AES0_CNT">
          <name>CRYPTO_AES3_CNT</name>
          <displayName>CRYPTO_AES3_CNT</displayName>
          <description>AES Byte Count Register for Channel 3</description>
          <addressOffset>0x1FC</addressOffset>
       </register>
       <register>
          <name>CRYPTO_TDES_CTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_TDES_CTL</displayName>
          <description>TDES/DES Control Register</description>
          <addressOffset>0x200</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>START</name>
              <description>TDES/DES Engine Start\nNote: The bit is always 0 when it's read back.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Start TDES/DES engine. The flag BUSY would be set</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>STOP</name>
              <description>TDES/DES Engine Stop\nNote: The bit is always 0 when it's read back.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Stop TDES/DES engine</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TMODE</name>
              <description>TDES/DES Engine Operating Mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Set DES mode for TDES/DES engine</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Set Triple DES mode for TDES/DES engine</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>_3KEYS</name>
              <description>TDES/DES Key Number</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Select KEY1 and KEY2 in TDES/DES engine</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Triple keys in TDES/DES engine Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DMALAST</name>
              <description>TDES/DES Engine Start for the Last Block \nIn DMA mode, this bit must be set as beginning the last DMA cascade round.\nIn Non-DMA mode, this bit must be set as feeding in last block of data.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMACSCAD</name>
              <description>TDES/DES Engine DMA with Cascade Mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>DMA cascade function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>In DMA Cascade mode, software can update DMA source address register, destination address register, and byte count register during a cascade operation, without finishing the accelerator operation</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAEN</name>
              <description>TDES/DES Engine DMA Enable Bit\nTDES engine operates in DMA mode, and data movement from/to the engine is done by DMA logic.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>TDES_DMA engine Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>TDES_DMA engine Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OPMODE</name>
              <description>TDES/DES Engine Operation Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>ECB (Electronic Codebook Mode)</description>
                    <value>0x00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>CBC (Cipher Block Chaining Mode)</description>
                    <value>0x01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>CFB (Cipher Feedback Mode)</description>
                    <value>0x02</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>OFB (Output Feedback Mode)</description>
                    <value>0x03</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>CTR (Counter Mode)</description>
                    <value>0x04</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ENCRYPTO</name>
              <description>TDES/DES Encryption/Decryption</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>TDES engine executes decryption operation</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>TDES engine executes encryption operation</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>BLKSWAP</name>
              <description>TDES/DES Engine Block Double Word Endian Swap </description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Keep the original order, e.g. {WORD_H, WORD_L}</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>When this bit is set to 1, the TDES engine would exchange high and low word in the sequence {WORD_L, WORD_H}</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTSWAP</name>
              <description>TDES/DES Engine Output Data Swap </description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Keep the original order</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The order that CPU outputs data from the accelerator will be changed from {byte3, byte2, byte1, byte0} to {byte0, byte1, byte2, byte3}</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>INSWAP</name>
              <description>TDES/DES Engine Input Data Swap </description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Keep the original order</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The order that CPU feeds data to the accelerator will be changed from {byte3, byte2, byte1, byte0} to {byte0, byte1, byte2, byte3}</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CHANNEL</name>
              <description>TDES/DES Engine Working Channel</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Current control register setting is for channel 0</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Current control register setting is for channel 1</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Current control register setting is for channel 2</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Current control register setting is for channel 3</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>KEYUNPRT</name>
              <description>Unprotect Key\nWriting 0 to CRYPTO_TDES_CTL [31] and '10110' to CRYPTO_TDES_CTL [30:26] is that TDES key is unprotected.\nThe KEYUNPRT can be read and written. When it is written as the TDES engine is operating, BUSY flag is 1, there would be no effect on KEYUNPRT.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KEYPRT</name>
              <description>Protect Key\nRead as a flag to reflect KEYPRT.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>This bit is to protect the content of TDES key from reading. The return value for reading CRYPTO_ TDESn_KEYxH/L is not the content in the registers CRYPTO_ TDESn_KEYxH/L. Once it is set, it can be cleared by asserting KEYUNPRT. The key content would be cleared as well</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
