iworx-systems/Zephyr-Dev-Container-Template/.devcontainer/M481_v1.svd
       <register>
          <name>CRYPTO_TDES_STS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_TDES_STS</displayName>
          <description>TDES/DES Engine Flag</description>
          <addressOffset>0x204</addressOffset>
          <access>read-only</access>
          <resetValue>0x00010100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BUSY</name>
              <description>TDES/DES Engine Busy </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>TDES/DES engine is idle or finished</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>TDES/DES engine is under processing</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>INBUFEMPTY</name>
              <description>TDES/DES in Buffer Empty</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>There are some data in input buffer waiting for the TDES/DES engine to process</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>TDES/DES input buffer is empty. Software needs to feed data to the TDES/DES engine. Otherwise, the TDES/DES engine will be pending to wait for input data</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>INBUFFULL</name>
              <description>TDES/DES in Buffer Full Flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>TDES/DES input buffer is not full. Software can feed the data into the TDES/DES engine</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>TDES input buffer is full. Software cannot feed data to the TDES/DES engine. Otherwise, the flag INBUFERR will be set to 1</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>INBUFERR</name>
              <description>TDES/DES in Buffer Error Flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Error happens during feeding data to the TDES/DES engine</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTBUFEMPTY</name>
              <description>TDES/DES Output Buffer Empty Flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>TDES/DES output buffer is not empty. There are some valid data kept in output buffer</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>TDES/DES output buffer is empty, Software cannot get data from TDES_DATA_OUT. Otherwise the flag OUTBUFERR will be set to 1, since output buffer is empty</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTBUFFULL</name>
              <description>TDES/DES Output Buffer Full Flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>TDES/DES output buffer is not full</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>TDES/DES output buffer is full, and software needs to get data from TDES_DATA_OUT. Otherwise, the TDES/DES engine will be pending since output buffer is full</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTBUFERR</name>
              <description>TDES/DES Out Buffer Error Flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Error happens during getting test result from TDES/DES engine</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSERR</name>
              <description>TDES/DES DMA Access Bus Error Flag</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Bus error will stop DMA operation and TDES/DES engine</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_TDES0_KEY1H</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_TDES0_KEY1H</displayName>
          <description>TDES/DES Key 1 High Word Register for Channel 0</description>
          <addressOffset>0x208</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEY</name>
              <description>TDES/DES Key High/Low Word\nThe key registers for TDES/DES algorithm calculation\nThe security key for the TDES/DES accelerator is 64 bits. Thus, it needs two 32-bit registers to store a security key. The register CRYPTO_TDESn_KEYxH is used to keep the bit [63:32] of security key for the TDES/DES operation, while the register CRYPTO_TDESn_KEYxL is used to keep the bit [31:0].</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_TDES0_KEY1H">
          <name>CRYPTO_TDES0_KEY1L</name>
          <displayName>CRYPTO_TDES0_KEY1L</displayName>
          <description>TDES/DES Key 1 Low Word Register for Channel 0</description>
          <addressOffset>0x20C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_TDES0_KEY1H">
          <name>CRYPTO_TDES0_KEY2H</name>
          <displayName>CRYPTO_TDES0_KEY2H</displayName>
          <description>TDES Key 2 High Word Register for Channel 0</description>
          <addressOffset>0x210</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_TDES0_KEY1H">
          <name>CRYPTO_TDES0_KEY2L</name>
          <displayName>CRYPTO_TDES0_KEY2L</displayName>
          <description>TDES Key 2 Low Word Register for Channel 0</description>
          <addressOffset>0x214</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_TDES0_KEY1H">
          <name>CRYPTO_TDES0_KEY3H</name>
          <displayName>CRYPTO_TDES0_KEY3H</displayName>
          <description>TDES Key 3 High Word Register for Channel 0</description>
          <addressOffset>0x218</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_TDES0_KEY1H">
          <name>CRYPTO_TDES0_KEY3L</name>
          <displayName>CRYPTO_TDES0_KEY3L</displayName>
          <description>TDES Key 3 Low Word Register for Channel 0</description>
          <addressOffset>0x21C</addressOffset>
       </register>
       <register>
          <name>CRYPTO_TDES0_IVH</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_TDES0_IVH</displayName>
          <description>TDES/DES Initial Vector High Word Register for Channel 0</description>
          <addressOffset>0x220</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IV</name>
              <description>TDES/DES Initial Vector High/Low Word\nInitial vector (IV) is for TDES/DES engine in CBC, CFB, and OFB mode. IV is Nonce counter for TDES/DES engine in CTR mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_TDES0_IVH">
          <name>CRYPTO_TDES0_IVL</name>
          <displayName>CRYPTO_TDES0_IVL</displayName>
          <description>TDES/DES Initial Vector Low Word Register for Channel 0</description>
          <addressOffset>0x224</addressOffset>
       </register>
       <register>
          <name>CRYPTO_TDES0_SADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_TDES0_SADDR</displayName>
          <description>TDES/DES DMA Source Address Register for Channel 0</description>
          <addressOffset>0x228</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SADDR</name>
              <description>TDES/DES DMA Source Address\nThe TDES/DES accelerator supports DMA function to transfer the plain text between SRAM memory space and embedded FIFO. The CRYPTO_TDESn_SADDR keeps the source address of the data buffer where the source text is stored. Based on the source address, the TDES/DES accelerator can read the plain text (encryption) / cipher text (decryption) from SRAM memory space and do TDES/DES operation. The start of source address should be located at word boundary. In other words, bit 1 and 0 of CRYPTO_TDESn_SADDR are ignored.\nCRYPTO_TDESn_SADDR can be read and written. Writing to CRYPTO_TDESn_SADDR while the TDES/DES accelerator is operating doesn't affect the current TDES/DES operation. But the value of CRYPTO_TDESn_SADDR will be updated later on. Consequently, software can prepare the DMA source address for the next TDES/DES operation.\nIn DMA mode, software can update the next CRYPTO_TDESn_SADDR before triggering START.\nCRYPTO_TDESn_SADDR and CRYPTO_TDESn_DADDR can be the same in the value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_TDES0_DADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_TDES0_DADDR</displayName>
          <description>TDES/DES DMA Destination Address Register for Channel 0</description>
          <addressOffset>0x22C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DADDR</name>
              <description>TDES/DES DMA Destination Address\nThe TDES/DES accelerator supports DMA function to transfer the cipher text between SRAM memory space and embedded FIFO. The CRYPTO_TDESn_DADDR keeps the destination address of the data buffer where the engine output's text will be stored. Based on the destination address, the TDES/DES accelerator can write the cipher text (encryption) / plain text (decryption) back to SRAM memory space after the TDES/DES operation is finished. The start of destination address should be located at word boundary. In other words, bit 1 and 0 of CRYPTO_TDESn_DADDR are ignored.\nCRYPTO_TDESn_DADDR can be read and written. Writing to CRYPTO_TDESn_DADDR while the TDES/DES accelerator is operating doesn't affect the current TDES/DES operation. But the value of CRYPTO_TDESn_DADDR will be updated later on. Consequently, software can prepare the destination address for the next TDES/DES operation.\nIn DMA mode, software can update the next CRYPTO_TDESn_DADDR before triggering START. \nCRYPTO_TDESn_SADDR and CRYPTO_TDESn_DADDR can be the same in the value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_TDES0_CNT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_TDES0_CNT</displayName>
          <description>TDES/DES Byte Count Register for Channel 0</description>
          <addressOffset>0x230</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>TDES/DES Byte Count \nThe CRYPTO_TDESn_CNT keeps the byte count of source text that is for the TDES/DES engine operating in DMA mode. The CRYPTO_TDESn_CNT is 32-bit and the maximum of byte count is 4G bytes.\nCRYPTO_TDESn_CNT can be read and written. Writing to CRYPTO_TDESn_CNT while the TDES/DES accelerator is operating doesn't affect the current TDES/DES operation. But the value of CRYPTO_TDESn_CNT will be updated later on. Consequently, software can prepare the byte count of data for the next TDES /DES operation.\nIn Non-DMA ECB, CBC, CFB, OFB, and CTR mode, CRYPTO_TDESn_CNT must be set as byte count for the last block of data before feeding in the last block of data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_TDES_DATIN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_TDES_DATIN</displayName>
          <description>TDES/DES Engine Input Data Word Register</description>
          <addressOffset>0x234</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATIN</name>
              <description>TDES/DES Engine Input Port\nCPU feeds data to TDES/DES engine through this port by checking CRYPTO_TDES_STS. Feed data when INBUFFULL is 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_TDES_DATOUT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_TDES_DATOUT</displayName>
          <description>TDES/DES Engine Output Data Word Register</description>
          <addressOffset>0x238</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATOUT</name>
              <description>TDES/DES Engine Output Port\nCPU gets result from the TDES/DES engine through this port by checking CRYPTO_TDES_STS. Get data when OUTBUFEMPTY is 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_TDES0_KEY1H">
          <name>CRYPTO_TDES1_KEY1H</name>
          <displayName>CRYPTO_TDES1_KEY1H</displayName>
          <description>TDES/DES Key 1 High Word Register for Channel 1</description>
          <addressOffset>0x248</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_TDES0_KEY1H">
          <name>CRYPTO_TDES1_KEY1L</name>
          <displayName>CRYPTO_TDES1_KEY1L</displayName>
          <description>TDES/DES Key 1 Low Word Register for Channel 1</description>
          <addressOffset>0x24C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_TDES0_KEY1H">
          <name>CRYPTO_TDES1_KEY2H</name>
          <displayName>CRYPTO_TDES1_KEY2H</displayName>
          <description>TDES Key 2 High Word Register for Channel 1</description>
          <addressOffset>0x250</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_TDES0_KEY1H">
          <name>CRYPTO_TDES1_KEY2L</name>
          <displayName>CRYPTO_TDES1_KEY2L</displayName>
          <description>TDES Key 2 Low Word Register for Channel 1</description>
          <addressOffset>0x254</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_TDES0_KEY1H">
          <name>CRYPTO_TDES1_KEY3H</name>
          <displayName>CRYPTO_TDES1_KEY3H</displayName>
          <description>TDES Key 3 High Word Register for Channel 1</description>
          <addressOffset>0x258</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_TDES0_KEY1H">
          <name>CRYPTO_TDES1_KEY3L</name>
          <displayName>CRYPTO_TDES1_KEY3L</displayName>
          <description>TDES Key 3 Low Word Register for Channel 1</description>
          <addressOffset>0x25C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_TDES0_IVH">
          <name>CRYPTO_TDES1_IVH</name>
          <displayName>CRYPTO_TDES1_IVH</displayName>
          <description>TDES/DES Initial Vector High Word Register for Channel 1</description>
          <addressOffset>0x260</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_TDES0_IVH">
          <name>CRYPTO_TDES1_IVL</name>
          <displayName>CRYPTO_TDES1_IVL</displayName>
          <description>TDES/DES Initial Vector Low Word Register for Channel 1</description>
          <addressOffset>0x264</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_TDES0_SADDR">
          <name>CRYPTO_TDES1_SADDR</name>
          <displayName>CRYPTO_TDES1_SADDR</displayName>
          <description>TDES/DES DMA Source Address Register for Channel 1</description>
          <addressOffset>0x268</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_TDES0_DADDR">
          <name>CRYPTO_TDES1_DADDR</name>
          <displayName>CRYPTO_TDES1_DADDR</displayName>
          <description>TDES/DES DMA Destination Address Register for Channel 1</description>
          <addressOffset>0x26C</addressOffset>
       </register>
