iworx-systems/Zephyr-Dev-Container-Template/.devcontainer/M481_v1.svd
       <register>
          <name>CRYPTO_ECC_CTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_CTL</displayName>
          <description>ECC Control Register</description>
          <addressOffset>0x800</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>START</name>
              <description>ECC Accelerator Start\nThis bit is always 0 when it's read back.\nECC accelerator will ignore this START signal when BUSY flag is 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Start ECC accelerator. BUSY flag will be set</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>STOP</name>
              <description>ECC Accelerator Stop\nThis bit is always 0 when it's read back.\nRemember to clear ECC interrupt flag after stopping ECC accelerator.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Abort ECC accelerator and make it into idle state</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAEN</name>
              <description>ECC Accelerator DMA Enable Bit\nOnly when START and DMAEN are 1, ECC DMA engine will be active</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>ECC DMA engine Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>ECC DMA engine Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>FSEL</name>
              <description>Field Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Binary Field (GF(2m ))</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Prime Field (GF(p))</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ECCOP</name>
              <description>Point Operation for BF and PF\nBesides above three input data, point operations still need the parameters of elliptic curve (CURVEA, CURVEB, CURVEN and CURVEM) as shown in Figure 6.27-11.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Point multiplication :</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Modulus operation : choose by MODOP (CRYPTO_ECC_CTL[12:11])</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Point addition :</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Point doubling :</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>MODOP</name>
              <description>Modulus Operation for PF</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Division :</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Multiplication :</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Addition :</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Subtraction :</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CSEL</name>
              <description>Curve Selection</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>NIST suggested curve</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Montgomery curve</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>LDP1</name>
              <description>The Control Signal of Register for the x and Y Coordinate of the First Point  (POINTX1, POINTY1)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The register for POINTX1 and  POINTY1 is not modified by DMA or user</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The register for POINTX1 and  POINTY1 is modified by DMA or user</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>LDP2</name>
              <description>The Control Signal of Register for the x and Y Coordinate of the Second Point (POINTX2, POINTY2)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The register for POINTX2 and  POINTY2 is not modified by DMA or user</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The register for POINTX2 and  POINTY2 is modified by DMA or user</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>LDA</name>
              <description>The Control Signal of Register for the Parameter CURVEA of Elliptic Curve</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The register for CURVEA is not modified by DMA or user</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The register for CURVEA is modified by DMA or user</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>LDB</name>
              <description>The Control Signal of Register for the Parameter CURVEB of Elliptic Curve </description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The register for CURVEB is not modified by DMA or user</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The register for CURVEB is modified by DMA or user</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>LDN</name>
              <description>The Control Signal of Register for the Parameter CURVEN of Elliptic Curve </description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The register for CURVEN is not modified by DMA or user</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The register for CURVEN is modified by DMA or user</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>LDK</name>
              <description>The Control Signal of Register for SCALARK </description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The register for SCALARK is not modified by DMA or user</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The register for SCALARK is modified by DMA or user</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CURVEM</name>
              <description>The key length of elliptic curve.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_ECC_STS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_STS</displayName>
          <description>ECC Status Register</description>
          <addressOffset>0x804</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BUSY</name>
              <description>ECC Accelerator Busy Flag\nRemember to clear ECC interrupt flag after ECC accelerator finished</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The ECC accelerator is idle or finished</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The ECC accelerator is under processing and protects all registers</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>DMABUSY</name>
              <description>ECC DMA Busy Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>ECC DMA is idle or finished</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>ECC DMA is busy</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSERR</name>
              <description>ECC DMA Access Bus Error Flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No error</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Bus error will stop DMA operation and ECC accelerator</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_ECC_X1_00</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_X1_00</displayName>
          <description>ECC X-coordinate Word0 of the First Point</description>
          <addressOffset>0x808</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>POINTX1</name>
              <description>ECC the X-coordinate Value of the First Point  (POINTX1)\nFor B-163 or K-163, POINTX1 is stored in CRYPTO_ECC_X1_00~CRYPTO_ECC_X1_05\nFor B-233 or K-233, POINTX1 is stored in CRYPTO_ECC_X1_00~CRYPTO_ECC_X1_07\nFor B-283 or K-283, POINTX1 is stored in CRYPTO_ECC_X1_00~CRYPTO_ECC_X1_08\nFor B-409 or K-409, POINTX1 is stored in CRYPTO_ECC_X1_00~CRYPTO_ECC_X1_12\nFor B-571 or K-571, POINTX1 is stored in CRYPTO_ECC_X1_00~CRYPTO_ECC_X1_17\nFor P-192, POINTX1 is stored in CRYPTO_ECC_X1_00~CRYPTO_ECC_X1_05\nFor P-224, POINTX1 is stored in CRYPTO_ECC_X1_00~CRYPTO_ECC_X1_06\nFor P-256, POINTX1 is stored in CRYPTO_ECC_X1_00~CRYPTO_ECC_X1_07\nFor P-384, POINTX1 is stored in CRYPTO_ECC_X1_00~CRYPTO_ECC_X1_11\nFor P-521, POINTX1 is stored in CRYPTO_ECC_X1_00~CRYPTO_ECC_X1_16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_01</name>
          <displayName>CRYPTO_ECC_X1_01</displayName>
          <description>ECC X-coordinate Word1 of the First Point</description>
          <addressOffset>0x80C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_02</name>
          <displayName>CRYPTO_ECC_X1_02</displayName>
          <description>ECC X-coordinate Word2 of the First Point</description>
          <addressOffset>0x810</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_03</name>
          <displayName>CRYPTO_ECC_X1_03</displayName>
          <description>ECC X-coordinate Word3 of the First Point</description>
          <addressOffset>0x814</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_04</name>
          <displayName>CRYPTO_ECC_X1_04</displayName>
          <description>ECC X-coordinate Word4 of the First Point</description>
          <addressOffset>0x818</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_05</name>
          <displayName>CRYPTO_ECC_X1_05</displayName>
          <description>ECC X-coordinate Word5 of the First Point</description>
          <addressOffset>0x81C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_06</name>
          <displayName>CRYPTO_ECC_X1_06</displayName>
          <description>ECC X-coordinate Word6 of the First Point</description>
          <addressOffset>0x820</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_07</name>
          <displayName>CRYPTO_ECC_X1_07</displayName>
          <description>ECC X-coordinate Word7 of the First Point</description>
          <addressOffset>0x824</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_08</name>
          <displayName>CRYPTO_ECC_X1_08</displayName>
          <description>ECC X-coordinate Word8 of the First Point</description>
          <addressOffset>0x828</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_09</name>
          <displayName>CRYPTO_ECC_X1_09</displayName>
          <description>ECC X-coordinate Word9 of the First Point</description>
          <addressOffset>0x82C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_10</name>
          <displayName>CRYPTO_ECC_X1_10</displayName>
          <description>ECC X-coordinate Word10 of the First Point</description>
          <addressOffset>0x830</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_11</name>
          <displayName>CRYPTO_ECC_X1_11</displayName>
          <description>ECC X-coordinate Word11 of the First Point</description>
          <addressOffset>0x834</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_12</name>
          <displayName>CRYPTO_ECC_X1_12</displayName>
          <description>ECC X-coordinate Word12 of the First Point</description>
          <addressOffset>0x838</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_13</name>
          <displayName>CRYPTO_ECC_X1_13</displayName>
          <description>ECC X-coordinate Word13 of the First Point</description>
          <addressOffset>0x83C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_14</name>
          <displayName>CRYPTO_ECC_X1_14</displayName>
          <description>ECC X-coordinate Word14 of the First Point</description>
          <addressOffset>0x840</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_15</name>
          <displayName>CRYPTO_ECC_X1_15</displayName>
          <description>ECC X-coordinate Word15 of the First Point</description>
          <addressOffset>0x844</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_16</name>
          <displayName>CRYPTO_ECC_X1_16</displayName>
          <description>ECC X-coordinate Word16 of the First Point</description>
          <addressOffset>0x848</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X1_00">
          <name>CRYPTO_ECC_X1_17</name>
          <displayName>CRYPTO_ECC_X1_17</displayName>
          <description>ECC X-coordinate Word17 of the First Point</description>
          <addressOffset>0x84C</addressOffset>
       </register>
       <register>
          <name>CRYPTO_ECC_Y1_00</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_Y1_00</displayName>
          <description>ECC Y-coordinate Word0 of the First Point</description>
          <addressOffset>0x850</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>POINTY1</name>
              <description>ECC the Y-coordinate Value of the First Point (POINTY1)\nFor B-163 or K-163, POINTY1 is stored in CRYPTO_ECC_Y1_00~CRYPTO_ECC_Y1_05\nFor B-233 or K-233, POINTY1 is stored in CRYPTO_ECC_Y1_00~CRYPTO_ECC_Y1_07\nFor B-283 or K-283, POINTY1 is stored in CRYPTO_ECC_Y1_00~CRYPTO_ECC_Y1_08\nFor B-409 or K-409, POINTY1 is stored in CRYPTO_ECC_Y1_00~CRYPTO_ECC_Y1_12\nFor B-571 or K-571, POINTY1 is stored in CRYPTO_ECC_Y1_00~CRYPTO_ECC_Y1_17\nFor P-192, POINTY1 is stored in CRYPTO_ECC_Y1_00~CRYPTO_ECC_Y1_05\nFor P-224, POINTY1 is stored in CRYPTO_ECC_Y1_00~CRYPTO_ECC_Y1_06\nFor P-256, POINTY1 is stored in CRYPTO_ECC_Y1_00~CRYPTO_ECC_Y1_07\nFor P-384, POINTY1 is stored in CRYPTO_ECC_Y1_00~CRYPTO_ECC_Y1_11\nFor P-521, POINTY1 is stored in CRYPTO_ECC_Y1_00~CRYPTO_ECC_Y1_16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
