iworx-systems/Zephyr-Dev-Container-Template/.devcontainer/M481_v1.svd
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_16</name>
          <displayName>CRYPTO_ECC_A_16</displayName>
          <description>ECC Parameter CURVEA Word16 of Elliptic Curve</description>
          <addressOffset>0x968</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_17</name>
          <displayName>CRYPTO_ECC_A_17</displayName>
          <description>ECC Parameter CURVEA Word17 of Elliptic Curve</description>
          <addressOffset>0x96C</addressOffset>
       </register>
       <register>
          <name>CRYPTO_ECC_B_00</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_B_00</displayName>
          <description>ECC Parameter CURVEB Word0 of Elliptic Curve</description>
          <addressOffset>0x970</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CURVEB</name>
              <description>ECC the Parameter CURVEB Value of Elliptic Curve (CURVEA)\nFor B-163 or K-163, CURVEB is stored in CRYPTO_ECC_B_00~CRYPTO_ECC_B_05\nFor B-233 or K-233, CURVEB is stored in CRYPTO_ECC_B_00~CRYPTO_ECC_B_07\nFor B-283 or K-283, CURVEB is stored in CRYPTO_ECC_B_00~CRYPTO_ECC_B_08\nFor B-409 or K-409, CURVEB is stored in CRYPTO_ECC_B_00~CRYPTO_ECC_B_12\nFor B-521 or K-521, CURVEB is stored in CRYPTO_ECC_B_00~CRYPTO_ECC_B_17\nFor P-192, CURVEB is stored in CRYPTO_ECC_B_00~CRYPTO_ECC_B_05\nFor P-224, CURVEB is stored in CRYPTO_ECC_B_00~CRYPTO_ECC_B_06\nFor P-256, CURVEB is stored in CRYPTO_ECC_B_00~CRYPTO_ECC_B_07\nFor P-384, CURVEB is stored in CRYPTO_ECC_B_00~CRYPTO_ECC_B_11\nFor P-521, CURVEB is stored in CRYPTO_ECC_B_00~CRYPTO_ECC_B_16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_01</name>
          <displayName>CRYPTO_ECC_B_01</displayName>
          <description>ECC Parameter CURVEB Word1 of Elliptic Curve</description>
          <addressOffset>0x974</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_02</name>
          <displayName>CRYPTO_ECC_B_02</displayName>
          <description>ECC Parameter CURVEB Word2 of Elliptic Curve</description>
          <addressOffset>0x978</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_03</name>
          <displayName>CRYPTO_ECC_B_03</displayName>
          <description>ECC Parameter CURVEB Word3 of Elliptic Curve</description>
          <addressOffset>0x97C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_04</name>
          <displayName>CRYPTO_ECC_B_04</displayName>
          <description>ECC Parameter CURVEB Word4 of Elliptic Curve</description>
          <addressOffset>0x980</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_05</name>
          <displayName>CRYPTO_ECC_B_05</displayName>
          <description>ECC Parameter CURVEB Word5 of Elliptic Curve</description>
          <addressOffset>0x984</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_06</name>
          <displayName>CRYPTO_ECC_B_06</displayName>
          <description>ECC Parameter CURVEB Word6 of Elliptic Curve</description>
          <addressOffset>0x988</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_07</name>
          <displayName>CRYPTO_ECC_B_07</displayName>
          <description>ECC Parameter CURVEB Word7 of Elliptic Curve</description>
          <addressOffset>0x98C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_08</name>
          <displayName>CRYPTO_ECC_B_08</displayName>
          <description>ECC Parameter CURVEB Word8 of Elliptic Curve</description>
          <addressOffset>0x990</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_09</name>
          <displayName>CRYPTO_ECC_B_09</displayName>
          <description>ECC Parameter CURVEB Word9 of Elliptic Curve</description>
          <addressOffset>0x994</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_10</name>
          <displayName>CRYPTO_ECC_B_10</displayName>
          <description>ECC Parameter CURVEB Word10 of Elliptic Curve</description>
          <addressOffset>0x998</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_11</name>
          <displayName>CRYPTO_ECC_B_11</displayName>
          <description>ECC Parameter CURVEB Word11 of Elliptic Curve</description>
          <addressOffset>0x99C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_12</name>
          <displayName>CRYPTO_ECC_B_12</displayName>
          <description>ECC Parameter CURVEB Word12 of Elliptic Curve</description>
          <addressOffset>0x9A0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_13</name>
          <displayName>CRYPTO_ECC_B_13</displayName>
          <description>ECC Parameter CURVEB Word13 of Elliptic Curve</description>
          <addressOffset>0x9A4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_14</name>
          <displayName>CRYPTO_ECC_B_14</displayName>
          <description>ECC Parameter CURVEB Word14 of Elliptic Curve</description>
          <addressOffset>0x9A8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_15</name>
          <displayName>CRYPTO_ECC_B_15</displayName>
          <description>ECC Parameter CURVEB Word15 of Elliptic Curve</description>
          <addressOffset>0x9AC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_16</name>
          <displayName>CRYPTO_ECC_B_16</displayName>
          <description>ECC Parameter CURVEB Word16 of Elliptic Curve</description>
          <addressOffset>0x9B0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_B_00">
          <name>CRYPTO_ECC_B_17</name>
          <displayName>CRYPTO_ECC_B_17</displayName>
          <description>ECC Parameter CURVEB Word17 of Elliptic Curve</description>
          <addressOffset>0x9B4</addressOffset>
       </register>
       <register>
          <name>CRYPTO_ECC_N_00</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_N_00</displayName>
          <description>ECC Parameter CURVEN Word0 of Elliptic Curve</description>
          <addressOffset>0x9B8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CURVEN</name>
              <description>ECC the Parameter CURVEN Value of Elliptic Curve (CURVEN)\nIn GF(p), CURVEN is the prime p.\nIn GF(2m), CURVEN is  the irreducible polynomial.\nFor B-163 or K-163, CURVEN is stored in CRYPTO_ECC_N_00~CRYPTO_ECC_N_05\nFor B-233 or K-233, CURVEN is stored in CRYPTO_ECC_N_00~CRYPTO_ECC_N_07\nFor B-283 or K-283, CURVEN is stored in CRYPTO_ECC_N_00~CRYPTO_ECC_N_08\nFor B-409 or K-409, CURVEN is stored in CRYPTO_ECC_N_00~CRYPTO_ECC_N_12\nFor B-571 or K-571, CURVEN is stored in CRYPTO_ECC_N_00~CRYPTO_ECC_N_17\nFor P-192, CURVEN is stored in CRYPTO_ECC_N_00~CRYPTO_ECC_N_05\nFor P-224, CURVEN is stored in CRYPTO_ECC_N_00~CRYPTO_ECC_N_06\nFor P-256, CURVEN is stored in CRYPTO_ECC_N_00~CRYPTO_ECC_N_07\nFor P-384, CURVEN is stored in CRYPTO_ECC_N_00~CRYPTO_ECC_N_11\nFor P-521, CURVEN is stored in CRYPTO_ECC_N_00~CRYPTO_ECC_N_16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_01</name>
          <displayName>CRYPTO_ECC_N_01</displayName>
          <description>ECC Parameter CURVEN Word1 of Elliptic Curve</description>
          <addressOffset>0x9BC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_02</name>
          <displayName>CRYPTO_ECC_N_02</displayName>
          <description>ECC Parameter CURVEN Word2 of Elliptic Curve</description>
          <addressOffset>0x9C0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_03</name>
          <displayName>CRYPTO_ECC_N_03</displayName>
          <description>ECC Parameter CURVEN Word3 of Elliptic Curve</description>
          <addressOffset>0x9C4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_04</name>
          <displayName>CRYPTO_ECC_N_04</displayName>
          <description>ECC Parameter CURVEN Word4 of Elliptic Curve</description>
          <addressOffset>0x9C8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_05</name>
          <displayName>CRYPTO_ECC_N_05</displayName>
          <description>ECC Parameter CURVEN Word5 of Elliptic Curve</description>
          <addressOffset>0x9CC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_06</name>
          <displayName>CRYPTO_ECC_N_06</displayName>
          <description>ECC Parameter CURVEN Word6 of Elliptic Curve</description>
          <addressOffset>0x9D0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_07</name>
          <displayName>CRYPTO_ECC_N_07</displayName>
          <description>ECC Parameter CURVEN Word7 of Elliptic Curve</description>
          <addressOffset>0x9D4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_08</name>
          <displayName>CRYPTO_ECC_N_08</displayName>
          <description>ECC Parameter CURVEN Word8 of Elliptic Curve</description>
          <addressOffset>0x9D8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_09</name>
          <displayName>CRYPTO_ECC_N_09</displayName>
          <description>ECC Parameter CURVEN Word9 of Elliptic Curve</description>
          <addressOffset>0x9DC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_10</name>
          <displayName>CRYPTO_ECC_N_10</displayName>
          <description>ECC Parameter CURVEN Word10 of Elliptic Curve</description>
          <addressOffset>0x9E0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_11</name>
          <displayName>CRYPTO_ECC_N_11</displayName>
          <description>ECC Parameter CURVEN Word11 of Elliptic Curve</description>
          <addressOffset>0x9E4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_12</name>
          <displayName>CRYPTO_ECC_N_12</displayName>
          <description>ECC Parameter CURVEN Word12 of Elliptic Curve</description>
          <addressOffset>0x9E8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_13</name>
          <displayName>CRYPTO_ECC_N_13</displayName>
          <description>ECC Parameter CURVEN Word13 of Elliptic Curve</description>
          <addressOffset>0x9EC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_14</name>
          <displayName>CRYPTO_ECC_N_14</displayName>
          <description>ECC Parameter CURVEN Word14 of Elliptic Curve</description>
          <addressOffset>0x9F0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_15</name>
          <displayName>CRYPTO_ECC_N_15</displayName>
          <description>ECC Parameter CURVEN Word15 of Elliptic Curve</description>
          <addressOffset>0x9F4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_16</name>
          <displayName>CRYPTO_ECC_N_16</displayName>
          <description>ECC Parameter CURVEN Word16 of Elliptic Curve</description>
          <addressOffset>0x9F8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_N_00">
          <name>CRYPTO_ECC_N_17</name>
          <displayName>CRYPTO_ECC_N_17</displayName>
          <description>ECC Parameter CURVEN Word17 of Elliptic Curve</description>
          <addressOffset>0x9FC</addressOffset>
       </register>
       <register>
          <name>CRYPTO_ECC_K_00</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_K_00</displayName>
          <description>ECC Scalar SCALARK Word0 of Point Multiplication</description>
          <addressOffset>0xA00</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCALARK</name>
              <description>ECC the Scalar SCALARK Value of Point Multiplication(SCALARK)\nBecause the SCALARK usually stores the private key, ECC accelerator do not allow to read the register SCALARK.\nFor B-163 or K-163, SCALARK is stored in CRYPTO_ECC_K_00~CRYPTO_ECC_K_05\nFor B-233 or K-233, SCALARK is stored in CRYPTO_ECC_K_00~CRYPTO_ECC_K_07\nFor B-283 or K-283, SCALARK is stored in CRYPTO_ECC_K_00~CRYPTO_ECC_K_08\nFor B-409 or K-409, SCALARK is stored in CRYPTO_ECC_K_00~CRYPTO_ECC_K_12\nFor B-571 or K-571, SCALARK is stored in CRYPTO_ECC_K_00~CRYPTO_ECC_K_17\nFor P-192, SCALARK is stored in CRYPTO_ECC_K_00~CRYPTO_ECC_K_05\nFor P-224, SCALARK is stored in CRYPTO_ECC_K_00~CRYPTO_ECC_K_06\nFor P-256, SCALARK is stored in CRYPTO_ECC_K_00~CRYPTO_ECC_K_07\nFor P-384, SCALARK is stored in CRYPTO_ECC_K_00~CRYPTO_ECC_K_11\nFor P-521, SCALARK is stored in CRYPTO_ECC_K_00~CRYPTO_ECC_K_16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_01</name>
          <displayName>CRYPTO_ECC_K_01</displayName>
          <description>ECC Scalar SCALARK Word1 of Point Multiplication</description>
          <addressOffset>0xA04</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_02</name>
          <displayName>CRYPTO_ECC_K_02</displayName>
          <description>ECC Scalar SCALARK Word2 of Point Multiplication</description>
          <addressOffset>0xA08</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_03</name>
          <displayName>CRYPTO_ECC_K_03</displayName>
          <description>ECC Scalar SCALARK Word3 of Point Multiplication</description>
          <addressOffset>0xA0C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_04</name>
          <displayName>CRYPTO_ECC_K_04</displayName>
          <description>ECC Scalar SCALARK Word4 of Point Multiplication</description>
          <addressOffset>0xA10</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_05</name>
          <displayName>CRYPTO_ECC_K_05</displayName>
          <description>ECC Scalar SCALARK Word5 of Point Multiplication</description>
          <addressOffset>0xA14</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_06</name>
          <displayName>CRYPTO_ECC_K_06</displayName>
          <description>ECC Scalar SCALARK Word6 of Point Multiplication</description>
          <addressOffset>0xA18</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_07</name>
          <displayName>CRYPTO_ECC_K_07</displayName>
          <description>ECC Scalar SCALARK Word7 of Point Multiplication</description>
          <addressOffset>0xA1C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_08</name>
          <displayName>CRYPTO_ECC_K_08</displayName>
          <description>ECC Scalar SCALARK Word8 of Point Multiplication</description>
          <addressOffset>0xA20</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_09</name>
          <displayName>CRYPTO_ECC_K_09</displayName>
          <description>ECC Scalar SCALARK Word9 of Point Multiplication</description>
          <addressOffset>0xA24</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_10</name>
          <displayName>CRYPTO_ECC_K_10</displayName>
          <description>ECC Scalar SCALARK Word10 of Point Multiplication</description>
          <addressOffset>0xA28</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_11</name>
          <displayName>CRYPTO_ECC_K_11</displayName>
          <description>ECC Scalar SCALARK Word11 of Point Multiplication</description>
          <addressOffset>0xA2C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_12</name>
          <displayName>CRYPTO_ECC_K_12</displayName>
          <description>ECC Scalar SCALARK Word12 of Point Multiplication</description>
          <addressOffset>0xA30</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_13</name>
          <displayName>CRYPTO_ECC_K_13</displayName>
          <description>ECC Scalar SCALARK Word13 of Point Multiplication</description>
          <addressOffset>0xA34</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_14</name>
          <displayName>CRYPTO_ECC_K_14</displayName>
          <description>ECC Scalar SCALARK Word14 of Point Multiplication</description>
          <addressOffset>0xA38</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_15</name>
          <displayName>CRYPTO_ECC_K_15</displayName>
          <description>ECC Scalar SCALARK Word15 of Point Multiplication</description>
          <addressOffset>0xA3C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_16</name>
          <displayName>CRYPTO_ECC_K_16</displayName>
          <description>ECC Scalar SCALARK Word16 of Point Multiplication</description>
          <addressOffset>0xA40</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_K_00">
          <name>CRYPTO_ECC_K_17</name>
          <displayName>CRYPTO_ECC_K_17</displayName>
          <description>ECC Scalar SCALARK Word17 of Point Multiplication</description>
          <addressOffset>0xA44</addressOffset>
       </register>
       <register>
          <name>CRYPTO_ECC_SADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_SADDR</displayName>
          <description>ECC DMA Source Address Register</description>
          <addressOffset>0xA48</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>CRYPTO_ECC_DADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_DADDR</displayName>
          <description>ECC DMA Destination Address Register</description>
          <addressOffset>0xA4C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DADDR</name>
              <description>ECC DMA Destination Address \nThe ECC accelerator supports DMA function to transfer the DATA and PARAMETER between SRAM memory and ECC accelerator. The DADDR keeps the destination address of the data buffer where output data of ECC engine will be stored. Based on the destination address, the ECC accelerator can write the result data back to SRAM memory space after the ECC operation is finished. The start of destination address should be located at word boundary. That is, bit 1 and 0 of DADDR are ignored. DADDR can be read and written. In DMA mode, software must update the CRYPTO_ECC_DADDR before triggering START.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_ECC_STARTREG</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_STARTREG</displayName>
          <description>ECC Starting Address of Updated Registers</description>
          <addressOffset>0xA50</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STARTREG</name>
              <description>ECC Starting Address of Updated Registers\nThe address of the updated registers that DMA feeds the first data or parameter to ECC engine. When ECC engine is active, ECC accelerator does not allow users to modify STARTREG,  for example, to update input data from register CRYPTO_ECC POINTX1. Thus, the value of STARTREG is 0x808.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
