iworx-systems/Zephyr-Dev-Container-Template/.devcontainer/M481_v1.svd
       <register derivedFrom="EADC0_PENDSTS">
          <name>EADC1_PENDSTS</name>
          <displayName>EADC1_PENDSTS</displayName>
          <description>EADC Start of Conversion Pending Flag Register</description>
          <alternateRegister>EADC0_PENDSTS</alternateRegister>
          <addressOffset>0x58</addressOffset>
       </register>
       <register>
          <name>EADC0_OVSTS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADC0_OVSTS</displayName>
          <description>EADC Sample Module Start of Conversion Overrun Flag Register</description>
          <addressOffset>0x5C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SPOVF</name>
              <description>EADC SAMPLE0~18 Overrun Flag\nNote: This bit is cleared by writing 1 to it.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No sample module event overrun</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Indicates a new sample module event is generated while an old one event is pending</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EADC0_OVSTS">
          <name>EADC1_OVSTS</name>
          <displayName>EADC1_OVSTS</displayName>
          <description>EADC Sample Module Start of Conversion Overrun Flag Register</description>
          <alternateRegister>EADC0_OVSTS</alternateRegister>
          <addressOffset>0x5C</addressOffset>
       </register>
       <register>
          <name>EADC0_SCTL0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADC0_SCTL0</displayName>
          <description>EADC Sample Module 0 Control Register</description>
          <addressOffset>0x80</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHSEL</name>
              <description>EADC Sample Module Channel Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTREN</name>
              <description>EADC External Trigger Rising Edge Enable Bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Rising edge Disabled when EADC selects EADC0_ST as trigger source</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Rising edge Enabled when EADC selects EADC0_ST as trigger source</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTFEN</name>
              <description>EADC External Trigger Falling Edge Enable Bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Falling edge Disabled when EADC selects EADC0_ST as trigger source</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Falling edge Enabled when EADC selects EADC0_ST as trigger source</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGDLYDIV</name>
              <description>EADC Sample Module Start of Conversion Trigger Delay Clock Divider Selection\nTrigger delay clock frequency: </description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>EADC_CLK/1</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>EADC_CLK/2</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>EADC_CLK/4</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>EADC_CLK/16</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGDLYCNT</name>
              <description>EADC Sample Module Start of Conversion Trigger Delay Time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGSEL</name>
              <description>EADC Sample Module Start of Conversion Trigger Source Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTPOS</name>
              <description>Interrupt Flag Position Select</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Set ADIFn (EADC_STATUS2[n], n=0~3) at EADC end of conversion</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Set ADIFn (EADC_STATUS2[n], n=0~3) at EADC start of conversion</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DBMEN</name>
              <description>Double Buffer Mode Enable Bit</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Sample has one sample result register (default)</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Sample has two sample result registers</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTSMPT</name>
              <description>EADC Sampling Time Extend\nWhen EADC converting at high conversion rate, the sampling time of analog input voltage may not enough if input channel loading is heavy, user can extend EADC sampling time after trigger source is coming to get enough sampling time.\nThe range of start delay time is from 0~255 EADC clock.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EADC0_SCTL0">
          <name>EADC1_SCTL0</name>
          <displayName>EADC1_SCTL0</displayName>
          <description>EADC Sample Module 0 Control Register</description>
          <alternateRegister>EADC0_SCTL0</alternateRegister>
          <addressOffset>0x80</addressOffset>
       </register>
       <register derivedFrom="EADC0_SCTL0">
          <name>EADC0_SCTL1</name>
          <displayName>EADC0_SCTL1</displayName>
          <description>EADC Sample Module 1 Control Register</description>
          <addressOffset>0x84</addressOffset>
       </register>
