iworx-systems/Zephyr-Dev-Container-Template/.devcontainer/M481_v1.svd
       <register derivedFrom="EADC0_SCTL5">
          <name>EADC1_SCTL5</name>
          <displayName>EADC1_SCTL5</displayName>
          <description>EADC Sample Module 5 Control Register</description>
          <alternateRegister>EADC0_SCTL5</alternateRegister>
          <addressOffset>0x94</addressOffset>
       </register>
       <register derivedFrom="EADC0_SCTL4">
          <name>EADC0_SCTL6</name>
          <displayName>EADC0_SCTL6</displayName>
          <description>EADC Sample Module 6 Control Register</description>
          <addressOffset>0x98</addressOffset>
       </register>
       <register derivedFrom="EADC0_SCTL6">
          <name>EADC1_SCTL6</name>
          <displayName>EADC1_SCTL6</displayName>
          <description>EADC Sample Module 6 Control Register</description>
          <alternateRegister>EADC0_SCTL6</alternateRegister>
          <addressOffset>0x98</addressOffset>
       </register>
       <register derivedFrom="EADC0_SCTL4">
          <name>EADC0_SCTL7</name>
          <displayName>EADC0_SCTL7</displayName>
          <description>EADC Sample Module 7 Control Register</description>
          <addressOffset>0x9C</addressOffset>
       </register>
       <register derivedFrom="EADC0_SCTL7">
          <name>EADC1_SCTL7</name>
          <displayName>EADC1_SCTL7</displayName>
          <description>EADC Sample Module 7 Control Register</description>
          <alternateRegister>EADC0_SCTL7</alternateRegister>
          <addressOffset>0x9C</addressOffset>
       </register>
       <register derivedFrom="EADC0_SCTL4">
          <name>EADC0_SCTL8</name>
          <displayName>EADC0_SCTL8</displayName>
          <description>EADC Sample Module 8 Control Register</description>
          <addressOffset>0xA0</addressOffset>
       </register>
       <register derivedFrom="EADC0_SCTL8">
          <name>EADC1_SCTL8</name>
          <displayName>EADC1_SCTL8</displayName>
          <description>EADC Sample Module 8 Control Register</description>
          <alternateRegister>EADC0_SCTL8</alternateRegister>
          <addressOffset>0xA0</addressOffset>
       </register>
       <register derivedFrom="EADC0_SCTL4">
          <name>EADC0_SCTL9</name>
          <displayName>EADC0_SCTL9</displayName>
          <description>EADC Sample Module 9 Control Register</description>
          <addressOffset>0xA4</addressOffset>
       </register>
       <register derivedFrom="EADC0_SCTL9">
          <name>EADC1_SCTL9</name>
          <displayName>EADC1_SCTL9</displayName>
          <description>EADC Sample Module 9 Control Register</description>
          <alternateRegister>EADC0_SCTL9</alternateRegister>
          <addressOffset>0xA4</addressOffset>
       </register>
       <register derivedFrom="EADC0_SCTL4">
          <name>EADC0_SCTL10</name>
          <displayName>EADC0_SCTL10</displayName>
          <description>EADC Sample Module 10 Control Register</description>
          <addressOffset>0xA8</addressOffset>
       </register>
       <register derivedFrom="EADC0_SCTL10">
          <name>EADC1_SCTL10</name>
          <displayName>EADC1_SCTL10</displayName>
          <description>EADC Sample Module 10 Control Register</description>
          <alternateRegister>EADC0_SCTL10</alternateRegister>
          <addressOffset>0xA8</addressOffset>
       </register>
       <register derivedFrom="EADC0_SCTL4">
          <name>EADC0_SCTL11</name>
          <displayName>EADC0_SCTL11</displayName>
          <description>EADC Sample Module 11 Control Register</description>
          <addressOffset>0xAC</addressOffset>
       </register>
       <register derivedFrom="EADC0_SCTL11">
          <name>EADC1_SCTL11</name>
          <displayName>EADC1_SCTL11</displayName>
          <description>EADC Sample Module 11 Control Register</description>
          <alternateRegister>EADC0_SCTL11</alternateRegister>
          <addressOffset>0xAC</addressOffset>
       </register>
       <register derivedFrom="EADC0_SCTL4">
          <name>EADC0_SCTL12</name>
          <displayName>EADC0_SCTL12</displayName>
          <description>EADC Sample Module 12 Control Register</description>
          <addressOffset>0xB0</addressOffset>
       </register>
       <register derivedFrom="EADC0_SCTL12">
          <name>EADC1_SCTL12</name>
          <displayName>EADC1_SCTL12</displayName>
          <description>EADC Sample Module 12 Control Register</description>
          <alternateRegister>EADC0_SCTL12</alternateRegister>
          <addressOffset>0xB0</addressOffset>
       </register>
       <register derivedFrom="EADC0_SCTL4">
          <name>EADC0_SCTL13</name>
          <displayName>EADC0_SCTL13</displayName>
          <description>EADC Sample Module 13 Control Register</description>
          <addressOffset>0xB4</addressOffset>
       </register>
       <register derivedFrom="EADC0_SCTL13">
          <name>EADC1_SCTL13</name>
          <displayName>EADC1_SCTL13</displayName>
          <description>EADC Sample Module 13 Control Register</description>
          <alternateRegister>EADC0_SCTL13</alternateRegister>
          <addressOffset>0xB4</addressOffset>
       </register>
       <register derivedFrom="EADC0_SCTL4">
          <name>EADC0_SCTL14</name>
          <displayName>EADC0_SCTL14</displayName>
          <description>EADC Sample Module 14 Control Register</description>
          <addressOffset>0xB8</addressOffset>
       </register>
       <register derivedFrom="EADC0_SCTL14">
          <name>EADC1_SCTL14</name>
          <displayName>EADC1_SCTL14</displayName>
          <description>EADC Sample Module 14 Control Register</description>
          <alternateRegister>EADC0_SCTL14</alternateRegister>
          <addressOffset>0xB8</addressOffset>
       </register>
       <register derivedFrom="EADC0_SCTL4">
          <name>EADC0_SCTL15</name>
          <displayName>EADC0_SCTL15</displayName>
          <description>EADC Sample Module 15 Control Register</description>
          <addressOffset>0xBC</addressOffset>
       </register>
       <register derivedFrom="EADC0_SCTL15">
          <name>EADC1_SCTL15</name>
          <displayName>EADC1_SCTL15</displayName>
          <description>EADC Sample Module 15 Control Register</description>
          <alternateRegister>EADC0_SCTL15</alternateRegister>
          <addressOffset>0xBC</addressOffset>
       </register>
       <register>
          <name>EADC0_SCTL16</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADC0_SCTL16</displayName>
          <description>EADC Sample Module 16 Control Register</description>
          <addressOffset>0xC0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EXTSMPT</name>
              <description>EADC Sampling Time Extend\nWhen EADC converting at high conversion rate, the sampling time of analog input voltage may not enough if input channel loading is heavy, SW can extend EADC sampling time after trigger source is coming to get enough sampling time.\nThe range of start delay time is from 0~255 EADC clock.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
