iworx-systems/Zephyr-Dev-Container-Template/.devcontainer/M481_v1.svd
              <description>for All Sample Module EADC Result Data Register EADC_DAT Data Valid Flag Check (Read Only)\nNote: This bit will keep 1 when any VALIDn Flag is equal to 1.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>None of sample module data register valid flag VALIDn (EADC_DATn[17]) is set to 1</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Any one of sample module data register valid flag VALIDn (EADC_DATn[17]) is set to 1</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>AOV</name>
              <description>for All Sample Module EADC Result Data Register Overrun Flags Check (Read Only)\nNote: This bit will keep 1 when any OVn Flag is equal to 1.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>None of sample module data register overrun flag OVn (EADC_DATn[16]) is set to 1</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Any one of sample module data register overrun flag OVn (EADC_DATn[16]) is set to 1</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EADC0_STATUS2">
          <name>EADC1_STATUS2</name>
          <displayName>EADC1_STATUS2</displayName>
          <description>EADC Status Register 2</description>
          <alternateRegister>EADC0_STATUS2</alternateRegister>
          <addressOffset>0xF8</addressOffset>
       </register>
       <register>
          <name>EADC0_STATUS3</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADC0_STATUS3</displayName>
          <description>EADC Status Register 3</description>
          <addressOffset>0xFC</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000001F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CURSPL</name>
              <description>EADC Current Sample Module (Read Only)\nThis register shows the current EADC is controlled by which sample module control logic modules.\nIf the EADC is Idle, the bit filed will set to 0x1F.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EADC0_STATUS3">
          <name>EADC1_STATUS3</name>
          <displayName>EADC1_STATUS3</displayName>
          <description>EADC Status Register 3</description>
          <alternateRegister>EADC0_STATUS3</alternateRegister>
          <addressOffset>0xFC</addressOffset>
       </register>
       <register>
          <name>EADC0_DDAT0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADC0_DDAT0</displayName>
          <description>EADC Double Data Register 0 for Sample Module 0</description>
          <addressOffset>0x100</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RESULT</name>
              <description>EADC Conversion Results\nThis field contains 12 bits conversion results.\nWhen the DMOF (EADC_CTL[9]) is set to 0, 12-bit EADC conversion result with unsigned format will be filled in RESULT [11:0] and zero will be filled in RESULT [15:12].\nWhen DMOF (EADC_CTL[9]) is set to 1, 12-bit EADC conversion result with 2'complement format will be filled in RESULT [11:0] and signed bits to will be filled in RESULT [15:12].</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OV</name>
              <description>Overrun Flag\nIf converted data in RESULT[15:0] has not been read before new conversion result is loaded to this register, OV is set to 1. It is cleared by hardware after EADC_DDAT register is read.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Data in RESULT (EADC_DATn[15:0], n=0~3) is recent conversion result</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Data in RESULT (EADC_DATn[15:0], n=0~3) is overwrite</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>VALID</name>
              <description>Valid Flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Double data in RESULT (EADC_DDATn[15:0]) is not valid</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Double data in RESULT (EADC_DDATn[15:0]) is valid</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EADC0_DDAT0">
          <name>EADC1_DDAT0</name>
          <displayName>EADC1_DDAT0</displayName>
          <description>EADC Double Data Register 0 for Sample Module 0</description>
          <alternateRegister>EADC0_DDAT0</alternateRegister>
          <addressOffset>0x100</addressOffset>
       </register>
       <register derivedFrom="EADC0_DDAT0">
          <name>EADC0_DDAT1</name>
          <displayName>EADC0_DDAT1</displayName>
          <description>EADC Double Data Register 1 for Sample Module 1</description>
          <addressOffset>0x104</addressOffset>
       </register>
       <register derivedFrom="EADC0_DDAT1">
          <name>EADC1_DDAT1</name>
          <displayName>EADC1_DDAT1</displayName>
          <description>EADC Double Data Register 1 for Sample Module 1</description>
          <alternateRegister>EADC0_DDAT1</alternateRegister>
          <addressOffset>0x104</addressOffset>
       </register>
       <register derivedFrom="EADC0_DDAT0">
          <name>EADC0_DDAT2</name>
          <displayName>EADC0_DDAT2</displayName>
          <description>EADC Double Data Register 2 for Sample Module 2</description>
          <addressOffset>0x108</addressOffset>
       </register>
       <register derivedFrom="EADC0_DDAT2">
          <name>EADC1_DDAT2</name>
          <displayName>EADC1_DDAT2</displayName>
          <description>EADC Double Data Register 2 for Sample Module 2</description>
          <alternateRegister>EADC0_DDAT2</alternateRegister>
          <addressOffset>0x108</addressOffset>
       </register>
       <register derivedFrom="EADC0_DDAT0">
          <name>EADC0_DDAT3</name>
          <displayName>EADC0_DDAT3</displayName>
          <description>EADC Double Data Register 3 for Sample Module 3</description>
          <addressOffset>0x10C</addressOffset>
       </register>
