iworx-systems/Zephyr-Dev-Container-Template/.devcontainer/M481_v1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>EADC1</name>
      <description>EADC Register Map</description>
      <groupName>EADC</groupName>
      <baseAddress>0x4004B000</baseAddress>
      <!-- d -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x60</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x80</offset>
        <size>0x4C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xD0</offset>
        <size>0x4C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x130</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>EADC0_DAT0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADC0_DAT0</displayName>
          <description>EADC Data Register 0 for Sample Module 0</description>
          <addressOffset>0x0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RESULT</name>
              <description>EADC Conversion Result\nThis field contains 12 bits conversion result.\nWhen DMOF (EADC_CTL[9]) is set to 0, 12-bit EADC conversion result with unsigned format will be filled in RESULT[11:0] and zero will be filled in RESULT[15:12].\nWhen DMOF (EADC_CTL[9]) set to 1, 12-bit EADC conversion result with 2'complement format will be filled in RESULT[11:0] and signed bits to will be filled in RESULT[15:12].</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OV</name>
              <description>Overrun Flag\nIf converted data in RESULT[11:0] has not been read before new conversion result is loaded to this register, OV is set to 1.\nNote: It is cleared by hardware after EADC_DAT register is read.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Data in RESULT[11:0] is recent conversion result</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Data in RESULT[11:0] is overwrite</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>VALID</name>
              <description>Valid Flag\nThis bit is set to 1 when corresponding sample module channel analog input conversion is completed and cleared by hardware after EADC_DAT register is read.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Data in RESULT[11:0] bits is not valid</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Data in RESULT[11:0] bits is valid</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EADC0_DAT0">
          <name>EADC1_DAT0</name>
          <displayName>EADC1_DAT0</displayName>
          <description>EADC Data Register 0 for Sample Module 0</description>
          <alternateRegister>EADC0_DAT0</alternateRegister>
          <addressOffset>0x0</addressOffset>
       </register>
       <register derivedFrom="EADC0_DAT0">
          <name>EADC0_DAT1</name>
          <displayName>EADC0_DAT1</displayName>
          <description>EADC Data Register 1 for Sample Module 1</description>
          <addressOffset>0x4</addressOffset>
       </register>
       <register derivedFrom="EADC0_DAT1">
          <name>EADC1_DAT1</name>
          <displayName>EADC1_DAT1</displayName>
          <description>EADC Data Register 1 for Sample Module 1</description>
          <alternateRegister>EADC0_DAT1</alternateRegister>
          <addressOffset>0x4</addressOffset>
       </register>
       <register derivedFrom="EADC0_DAT0">
          <name>EADC0_DAT2</name>
          <displayName>EADC0_DAT2</displayName>
          <description>EADC Data Register 2 for Sample Module 2</description>
          <addressOffset>0x8</addressOffset>
       </register>
       <register derivedFrom="EADC0_DAT2">
          <name>EADC1_DAT2</name>
          <displayName>EADC1_DAT2</displayName>
          <description>EADC Data Register 2 for Sample Module 2</description>
          <alternateRegister>EADC0_DAT2</alternateRegister>
          <addressOffset>0x8</addressOffset>
       </register>
       <register derivedFrom="EADC0_DAT0">
          <name>EADC0_DAT3</name>
          <displayName>EADC0_DAT3</displayName>
          <description>EADC Data Register 3 for Sample Module 3</description>
          <addressOffset>0xC</addressOffset>
       </register>
       <register derivedFrom="EADC0_DAT3">
          <name>EADC1_DAT3</name>
          <displayName>EADC1_DAT3</displayName>
          <description>EADC Data Register 3 for Sample Module 3</description>
          <alternateRegister>EADC0_DAT3</alternateRegister>
          <addressOffset>0xC</addressOffset>
       </register>
       <register derivedFrom="EADC0_DAT0">
          <name>EADC0_DAT4</name>
          <displayName>EADC0_DAT4</displayName>
          <description>EADC Data Register 4 for Sample Module 4</description>
          <addressOffset>0x10</addressOffset>
       </register>
       <register derivedFrom="EADC0_DAT4">
          <name>EADC1_DAT4</name>
          <displayName>EADC1_DAT4</displayName>
          <description>EADC Data Register 4 for Sample Module 4</description>
          <alternateRegister>EADC0_DAT4</alternateRegister>
          <addressOffset>0x10</addressOffset>
       </register>
       <register derivedFrom="EADC0_DAT0">
          <name>EADC0_DAT5</name>
          <displayName>EADC0_DAT5</displayName>
          <description>EADC Data Register 5 for Sample Module 5</description>
          <addressOffset>0x14</addressOffset>
       </register>
       <register derivedFrom="EADC0_DAT5">
          <name>EADC1_DAT5</name>
          <displayName>EADC1_DAT5</displayName>
          <description>EADC Data Register 5 for Sample Module 5</description>
          <alternateRegister>EADC0_DAT5</alternateRegister>
          <addressOffset>0x14</addressOffset>
       </register>
       <register derivedFrom="EADC0_DAT0">
          <name>EADC0_DAT6</name>
          <displayName>EADC0_DAT6</displayName>
          <description>EADC Data Register 6 for Sample Module 6</description>
          <addressOffset>0x18</addressOffset>
       </register>
