iworx-systems/Zephyr-Dev-Container-Template/.devcontainer/M481_v1.svd
       <register derivedFrom="EADC0_DAT6">
          <name>EADC1_DAT6</name>
          <displayName>EADC1_DAT6</displayName>
          <description>EADC Data Register 6 for Sample Module 6</description>
          <alternateRegister>EADC0_DAT6</alternateRegister>
          <addressOffset>0x18</addressOffset>
       </register>
       <register derivedFrom="EADC0_DAT0">
          <name>EADC0_DAT7</name>
          <displayName>EADC0_DAT7</displayName>
          <description>EADC Data Register 7 for Sample Module 7</description>
          <addressOffset>0x1C</addressOffset>
       </register>
       <register derivedFrom="EADC0_DAT7">
          <name>EADC1_DAT7</name>
          <displayName>EADC1_DAT7</displayName>
          <description>EADC Data Register 7 for Sample Module 7</description>
          <alternateRegister>EADC0_DAT7</alternateRegister>
          <addressOffset>0x1C</addressOffset>
       </register>
       <register derivedFrom="EADC0_DAT0">
          <name>EADC0_DAT8</name>
          <displayName>EADC0_DAT8</displayName>
          <description>EADC Data Register 8 for Sample Module 8</description>
          <addressOffset>0x20</addressOffset>
       </register>
       <register derivedFrom="EADC0_DAT8">
          <name>EADC1_DAT8</name>
          <displayName>EADC1_DAT8</displayName>
          <description>EADC Data Register 8 for Sample Module 8</description>
          <alternateRegister>EADC0_DAT8</alternateRegister>
          <addressOffset>0x20</addressOffset>
       </register>
       <register derivedFrom="EADC0_DAT0">
          <name>EADC0_DAT9</name>
          <displayName>EADC0_DAT9</displayName>
          <description>EADC Data Register 9 for Sample Module 9</description>
          <addressOffset>0x24</addressOffset>
       </register>
       <register derivedFrom="EADC0_DAT9">
          <name>EADC1_DAT9</name>
          <displayName>EADC1_DAT9</displayName>
          <description>EADC Data Register 9 for Sample Module 9</description>
          <alternateRegister>EADC0_DAT9</alternateRegister>
          <addressOffset>0x24</addressOffset>
       </register>
       <register derivedFrom="EADC0_DAT0">
          <name>EADC0_DAT10</name>
          <displayName>EADC0_DAT10</displayName>
          <description>EADC Data Register 10 for Sample Module 10</description>
          <addressOffset>0x28</addressOffset>
       </register>
       <register derivedFrom="EADC0_DAT10">
          <name>EADC1_DAT10</name>
          <displayName>EADC1_DAT10</displayName>
          <description>EADC Data Register 10 for Sample Module 10</description>
          <alternateRegister>EADC0_DAT10</alternateRegister>
          <addressOffset>0x28</addressOffset>
       </register>
       <register derivedFrom="EADC0_DAT0">
          <name>EADC0_DAT11</name>
          <displayName>EADC0_DAT11</displayName>
          <description>EADC Data Register 11 for Sample Module 11</description>
          <addressOffset>0x2C</addressOffset>
       </register>
       <register derivedFrom="EADC0_DAT11">
          <name>EADC1_DAT11</name>
          <displayName>EADC1_DAT11</displayName>
          <description>EADC Data Register 11 for Sample Module 11</description>
          <alternateRegister>EADC0_DAT11</alternateRegister>
          <addressOffset>0x2C</addressOffset>
       </register>
       <register derivedFrom="EADC0_DAT0">
          <name>EADC0_DAT12</name>
          <displayName>EADC0_DAT12</displayName>
          <description>EADC Data Register 12 for Sample Module 12</description>
          <addressOffset>0x30</addressOffset>
       </register>
       <register derivedFrom="EADC0_DAT12">
          <name>EADC1_DAT12</name>
          <displayName>EADC1_DAT12</displayName>
          <description>EADC Data Register 12 for Sample Module 12</description>
          <alternateRegister>EADC0_DAT12</alternateRegister>
          <addressOffset>0x30</addressOffset>
       </register>
       <register derivedFrom="EADC0_DAT0">
          <name>EADC0_DAT13</name>
          <displayName>EADC0_DAT13</displayName>
          <description>EADC Data Register 13 for Sample Module 13</description>
          <addressOffset>0x34</addressOffset>
       </register>
       <register derivedFrom="EADC0_DAT13">
          <name>EADC1_DAT13</name>
          <displayName>EADC1_DAT13</displayName>
          <description>EADC Data Register 13 for Sample Module 13</description>
          <alternateRegister>EADC0_DAT13</alternateRegister>
          <addressOffset>0x34</addressOffset>
       </register>
       <register derivedFrom="EADC0_DAT0">
          <name>EADC0_DAT14</name>
          <displayName>EADC0_DAT14</displayName>
          <description>EADC Data Register 14 for Sample Module 14</description>
          <addressOffset>0x38</addressOffset>
       </register>
       <register derivedFrom="EADC0_DAT14">
          <name>EADC1_DAT14</name>
          <displayName>EADC1_DAT14</displayName>
          <description>EADC Data Register 14 for Sample Module 14</description>
          <alternateRegister>EADC0_DAT14</alternateRegister>
          <addressOffset>0x38</addressOffset>
       </register>
       <register derivedFrom="EADC0_DAT0">
          <name>EADC0_DAT15</name>
          <displayName>EADC0_DAT15</displayName>
          <description>EADC Data Register 15 for Sample Module 15</description>
          <addressOffset>0x3C</addressOffset>
       </register>
       <register derivedFrom="EADC0_DAT15">
          <name>EADC1_DAT15</name>
          <displayName>EADC1_DAT15</displayName>
          <description>EADC Data Register 15 for Sample Module 15</description>
          <alternateRegister>EADC0_DAT15</alternateRegister>
          <addressOffset>0x3C</addressOffset>
       </register>
       <register derivedFrom="EADC0_DAT0">
          <name>EADC0_DAT16</name>
          <displayName>EADC0_DAT16</displayName>
          <description>EADC Data Register 16 for Sample Module 16</description>
          <addressOffset>0x40</addressOffset>
       </register>
       <register derivedFrom="EADC0_DAT16">
          <name>EADC1_DAT16</name>
          <displayName>EADC1_DAT16</displayName>
          <description>EADC Data Register 16 for Sample Module 16</description>
          <alternateRegister>EADC0_DAT16</alternateRegister>
          <addressOffset>0x40</addressOffset>
       </register>
       <register derivedFrom="EADC0_DAT0">
          <name>EADC0_DAT17</name>
          <displayName>EADC0_DAT17</displayName>
          <description>EADC Data Register 17 for Sample Module 17</description>
          <addressOffset>0x44</addressOffset>
       </register>
