iworx-systems/Zephyr-Dev-Container-Template/.devcontainer/M481_v1.svd
       <register derivedFrom="EADC0_DDAT3">
          <name>EADC1_DDAT3</name>
          <displayName>EADC1_DDAT3</displayName>
          <description>EADC Double Data Register 3 for Sample Module 3</description>
          <alternateRegister>EADC0_DDAT3</alternateRegister>
          <addressOffset>0x10C</addressOffset>
       </register>
       <register>
          <name>EADC0_PWRM</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADC0_PWRM</displayName>
          <description>EADC Power Management Register</description>
          <addressOffset>0x110</addressOffset>
          <access>read-write</access>
          <resetValue>0x0006E012</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PWUPRDY</name>
              <description>EADC Power-up Sequence Completed and Ready for Conversion (Read Only)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>EADC is not ready for conversion may be in power down state or in the progress of start up</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>EADC is ready for conversion</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>PWUCALEN</name>
              <description>Power Up Calibration Function Enable Bit\nNote: This bit work together with CALSEL (EADC_CALCTL [3]), see the following\n{PWUCALEN, CALSEL } Description:\nPWUCALEN is 0 and CALSEL is 0: No need to calibrate. \nPWUCALEN is 0 and CALSEL is 1: No need to calibrate.\nPWUCALEN is 1 and CALSEL is 0: Load calibration word when power up.\nPWUCALEN is 1 and CALSEL is 1: Calibrate when power up.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Calibration function Disabled at power up</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Calibration function Enabled at power up</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PWDMOD</name>
              <description>EADC Power-down Mode\nSet this bit field to select EADC Power-down mode when system power-down.\nNote: Different PWDMOD has different power down/up sequence, in order to avoid EADC powering up with wrong sequence; user must keep PWDMOD consistent each time in power down and start up.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>EADC Deep Power-down mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>EADC Power down</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>EADC Standby mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>EADC Deep Power-down mode</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>LDOSUT</name>
              <description>EADC Internal LDO Start-up Time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EADC0_PWRM">
          <name>EADC1_PWRM</name>
          <displayName>EADC1_PWRM</displayName>
          <description>EADC Power Management Register</description>
          <alternateRegister>EADC0_PWRM</alternateRegister>
          <addressOffset>0x110</addressOffset>
       </register>
       <register>
          <name>EADC0_CALCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADC0_CALCTL</displayName>
          <description>EADC Calibration Control Register</description>
          <addressOffset>0x114</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000008</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CALSTART</name>
              <description>Calibration Functional Block Start\nNote 1: This bit is set by SW and clear by HW after re-calibration finish.\nNote 2: Before set CALSTART (EADC_CALCTL[1]) as 1 to start calibration again, EADCDIV (CKL_CLKDIV0[23:16]) must be 0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Stop calibration functional block</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Start calibration functional block</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CALDONE</name>
              <description>Calibration Functional Block Complete (Read Only)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>During a calibration</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Calibration is completed</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>CALSEL</name>
              <description>Select Calibration Functional Block</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Load calibration word when calibration functional block is active</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Execute calibration when calibration functional block is active</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EADC0_CALCTL">
          <name>EADC1_CALCTL</name>
          <displayName>EADC1_CALCTL</displayName>
          <description>EADC Calibration Control Register</description>
          <alternateRegister>EADC0_CALCTL</alternateRegister>
          <addressOffset>0x114</addressOffset>
       </register>
       <register>
          <name>EADC0_CALDWRD</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADC0_CALDWRD</displayName>
          <description>EADC Calibration Load Word Register</description>
          <addressOffset>0x118</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFF00</resetMask>
          <fields>
            <field>
              <name>CALWORD</name>
              <description>Calibration Word Bits\nWrite to this register with the previous calibration word before load calibration action.\nRead this register after calibration done.\nNote: The calibration block contains two parts 'CALIBRATION' and 'LOAD CALIBRATION'; if the calibration block configure as 'CALIBRATION'; then this register represent the result of calibration when calibration is completed; if configure as 'LOAD CALIBRATION' ; configure this register before loading calibration action, after loading calibration complete, the laoded calibration word will apply to the EADC; while in loading calibration function the loaded value will not be equal to the original CALWORD until calibration is done.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EADC0_CALDWRD">
          <name>EADC1_CALDWRD</name>
          <displayName>EADC1_CALDWRD</displayName>
          <description>EADC Calibration Load Word Register</description>
          <alternateRegister>EADC0_CALDWRD</alternateRegister>
          <addressOffset>0x118</addressOffset>
       </register>
       <register>
          <name>EADC0_PDMACTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADC0_PDMACTL</displayName>
          <description>EADC PDMA Control Register</description>
          <addressOffset>0x130</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDMATEN</name>
              <description>PDMA Transfer Enable Bit\nWhen EADC conversion is completed, the converted data is loaded into EADC_DATn (n: 0 ~ 18) register, user can enable this bit to generate a PDMA data transfer request.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PDMA data transfer Disabled</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PDMA data transfer Enabled</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EADC0_PDMACTL">
          <name>EADC1_PDMACTL</name>
          <displayName>EADC1_PDMACTL</displayName>
          <description>EADC PDMA Control Register</description>
          <alternateRegister>EADC0_PDMACTL</alternateRegister>
          <addressOffset>0x130</addressOffset>
       </register>
